window.EVAL_DATA = {
  "rawResponses": [
    {
      "id": 1,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到很多國文常識",
            "toTeacher": "無",
            "toSchool": "吳"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很有趣",
            "toTeacher": "無",
            "toSchool": "吳"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多數學知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多歷史知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多地理知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多生物知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A+(教師：Gina)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到更多英文知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 3,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "普通",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "同意",
            "2": "非常不同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常不同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "不同意",
            "9": "非常同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A+(教師：Gina)",
          "ratings": {
            "1": "不同意",
            "2": "同意",
            "3": "不同意",
            "4": "同意",
            "5": "同意",
            "6": "不同意",
            "7": "普通",
            "8": "同意",
            "9": "普通",
            "10": "不同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "同意",
            "4": "同意",
            "5": "普通",
            "6": "普通",
            "7": "不同意",
            "8": "普通",
            "9": "同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "不同意",
            "8": "同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        }
      ]
    },
    {
      "id": 4,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "文言文的閱讀技巧",
            "toTeacher": "老師你好",
            "toSchool": "宜霖老師人很好 我很喜歡"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "許多文法和聽力練習",
            "toTeacher": "老師你好",
            "toSchool": "棒棒"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "數學的應用",
            "toTeacher": "老師你好",
            "toSchool": "我很喜歡老師的上課方式"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "歷史上發生的趣事",
            "toTeacher": "老師你好",
            "toSchool": "棒棒"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "人口和產業",
            "toTeacher": "老師你好",
            "toSchool": "上課很有趣"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "社會安全和倫理道德",
            "toTeacher": "老師你好",
            "toSchool": "棒棒"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "生物的分類",
            "toTeacher": "老師你好",
            "toSchool": "我覺得生物很有趣 我很喜歡"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A1(教師：Chad)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多英文",
            "toTeacher": "Hi",
            "toSchool": "Nice"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "動手的能力",
            "toTeacher": "老師你好",
            "toSchool": "棒棒"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "節奏",
            "toTeacher": "老師你好",
            "toSchool": "棒棒"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "足壘",
            "toTeacher": "老師你好",
            "toSchool": "棒棒"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "一些做人處事的道理",
            "toTeacher": "老師你好",
            "toSchool": "棒棒"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "閩南語的唱歌",
            "toTeacher": "老師你好",
            "toSchool": "棒"
          }
        }
      ]
    },
    {
      "id": 5,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "變好",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A+(教師：Gina)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "變好",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 6,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "good",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "good",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "數學",
          "teacher": "桂松山",
          "group": "B(教師：桂松山)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "good",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "good",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "good",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "good",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "不同意",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "good",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A+(教師：Gina)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "good",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "good",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "不同意",
            "5": "不同意",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "good",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "very good",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "good",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "普通",
            "4": "普通",
            "5": "不同意",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "good",
            "toTeacher": "no",
            "toSchool": "no"
          }
        }
      ]
    },
    {
      "id": 7,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "不同意",
            "7": "不同意",
            "8": "不同意",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "不知",
            "toTeacher": "感謝",
            "toSchool": "][\\軮"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "不同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "學會如何用ed",
            "toSchool": "拉完了"
          }
        },
        {
          "subject": "數學",
          "teacher": "桂松山",
          "group": "B(教師：桂松山)",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "不同意",
            "4": "不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "不知",
            "toSchool": "ˋ"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "拉完了"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A2(教師：Roja)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "不同意",
            "4": "不同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "古靜宜",
          "group": "手語(教師：古靜宜)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "比手語手語",
            "toTeacher": "下學期可以給我們吃餅乾",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 8,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "一般",
            "toTeacher": "一般",
            "toSchool": "一般"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "一般",
            "toTeacher": "一般",
            "toSchool": "一般"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "一般",
            "toTeacher": "一般",
            "toSchool": "一般"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "一般",
            "toTeacher": "一般",
            "toSchool": "一般"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "一般",
            "toTeacher": "一般",
            "toSchool": "一般"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "一般",
            "toTeacher": "一般",
            "toSchool": "一般"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "一般",
            "toTeacher": "一般",
            "toSchool": "一般"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A2(教師：Roja)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "一般",
            "toTeacher": "一般",
            "toSchool": "一般"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "一般",
            "toTeacher": "一般",
            "toSchool": "一般"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "1",
            "toTeacher": "1",
            "toSchool": "1"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "1",
            "toTeacher": "1",
            "toSchool": "1"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "不同意",
            "4": "不同意",
            "5": "不同意",
            "6": "不同意",
            "7": "不同意",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "無聊",
            "toTeacher": "無聊",
            "toSchool": "無聊"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "1",
            "toTeacher": "1",
            "toSchool": "1"
          }
        }
      ]
    },
    {
      "id": 10,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "普通",
            "5": "不同意",
            "6": "同意",
            "7": "非常同意",
            "8": "普通",
            "9": "非常同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "還行",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "夯爆了",
            "toTeacher": "超好",
            "toSchool": "希望還能教a1"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "超好",
            "toTeacher": "希望還能教a1+",
            "toSchool": "很好"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "很多東西",
            "toTeacher": "人很好",
            "toSchool": "no"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地理教得很好",
            "toTeacher": "超棒的",
            "toSchool": "67"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "很多有用的東西",
            "toTeacher": "很好",
            "toSchool": "no"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "很多實驗 超棒的",
            "toTeacher": "超好的",
            "toSchool": "no"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A+(教師：Gina)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "very good i have learn many grammar and words",
            "toTeacher": "very good",
            "toSchool": "no"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到很多scratch東西",
            "toTeacher": "很好",
            "toSchool": "非常棒"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "一些音符",
            "toTeacher": "還好",
            "toSchool": "一般"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多球類運動",
            "toTeacher": "超好",
            "toSchool": "超棒"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "很多有關生命",
            "toTeacher": "超棒",
            "toSchool": "很好"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "普通",
            "7": "普通",
            "8": "同意",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很多台語",
            "toTeacher": "還好",
            "toSchool": "no"
          }
        }
      ]
    },
    {
      "id": 11,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "知道語詞",
            "toTeacher": "謝謝老師",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "否",
            "toTeacher": "謝謝老師",
            "toSchool": "否"
          }
        },
        {
          "subject": "數學",
          "teacher": "桂松山",
          "group": "B(教師：桂松山)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "否",
            "toTeacher": "謝謝老師",
            "toSchool": "否"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "知道日治時期",
            "toTeacher": "謝謝老師",
            "toSchool": "否"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "知道台灣地圖",
            "toTeacher": "謝謝老師",
            "toSchool": "否"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "知道",
            "toTeacher": "謝謝老師",
            "toSchool": "否"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "知道動物",
            "toTeacher": "謝謝老師",
            "toSchool": "否"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A2(教師：Roja)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "讚",
            "toTeacher": "謝謝老師",
            "toSchool": "否"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "否",
            "toTeacher": "謝謝老師",
            "toSchool": "否"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "讚",
            "toTeacher": "謝謝老師",
            "toSchool": "否"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "運動身體好",
            "toTeacher": "謝謝老師",
            "toSchool": "否"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "懂生命的意義",
            "toTeacher": "謝謝老師",
            "toSchool": "否"
          }
        },
        {
          "subject": "本土語",
          "teacher": "古靜宜",
          "group": "手語(教師：古靜宜)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很好",
            "toTeacher": "謝謝老師",
            "toSchool": "天天有手語課"
          }
        }
      ]
    },
    {
      "id": 12,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "learn more things",
            "toTeacher": "thank you for teaching me",
            "toSchool": "no"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "I learn many new thing.",
            "toTeacher": "I like you class.You are nice.",
            "toSchool": "no"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": ".",
            "toTeacher": ".",
            "toSchool": "."
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "不同意",
            "4": "不同意",
            "5": "不同意",
            "6": "不同意",
            "7": "不同意",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": ".",
            "toTeacher": ".",
            "toSchool": "."
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": ".",
            "toTeacher": ".",
            "toSchool": "."
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": ".",
            "toTeacher": ".",
            "toSchool": "."
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "good",
            "toTeacher": "good",
            "toSchool": "."
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A1(教師：Chad)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": ".",
            "toTeacher": ".",
            "toSchool": "."
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "不同意",
            "4": "不同意",
            "5": "不同意",
            "6": "不同意",
            "7": "不同意",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": ".",
            "toTeacher": ".",
            "toSchool": "."
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "不同意",
            "4": "不同意",
            "5": "不同意",
            "6": "不同意",
            "7": "不同意",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": ".",
            "toTeacher": ".",
            "toSchool": "."
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "good",
            "toTeacher": "nice",
            "toSchool": "."
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": ".",
            "toTeacher": ".",
            "toSchool": "."
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "不同意",
            "4": "不同意",
            "5": "不同意",
            "6": "不同意",
            "7": "不同意",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": ".",
            "toTeacher": ".",
            "toSchool": "."
          }
        }
      ]
    },
    {
      "id": 13,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "普通",
            "6": "普通",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "國語變好",
            "toTeacher": "謝謝",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "非常不同意",
            "4": "不同意",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "讓英文亙好",
            "toTeacher": "謝謝",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "普通",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "讓我數學變好",
            "toTeacher": "謝謝",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "歷史變好",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "地理變好",
            "toTeacher": "課程很有趣",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "普通",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "公民好",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "生物好",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Sandra",
          "group": "B(教師：Sandra)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "普通",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文變好",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "不知道",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "音樂",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "普通",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "好玩 體育變好",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 15,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "不同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到很多東西",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到很多東西",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "桂松山",
          "group": "B(教師：桂松山)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到很多東西",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到很多東西",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到很多東西",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到很多東西",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到很多東西",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A2(教師：Roja)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "普通",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到很多東西",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到很多東西",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "不同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "學到很多東西",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "學到很多東西",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到很多東西",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "學到很多東西",
            "toTeacher": "辛苦了",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 16,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "國文知識增加",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "不同意",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "英文知識增加",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "數理知識增加",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "同意",
            "8": "普通",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "歷史知識增加",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "普通",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地理知識增加",
            "toTeacher": "上課非常有趣",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "不同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "公民知識增加",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "不同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "生物知識增加",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A+(教師：Gina)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "普通",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文知識增加",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "木工",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "音樂",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "體育知識",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "做人處事",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "同意",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "本土語",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        }
      ]
    },
    {
      "id": 18,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "NO"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "非常不同意",
            "2": "不同意",
            "3": "不同意",
            "4": "不同意",
            "5": "不同意",
            "6": "不同意",
            "7": "不同意",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NNO",
            "toSchool": "NO"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "ONNNNN",
            "toTeacher": "NO",
            "toSchool": "ON"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOONO"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "NO"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "NI",
            "toTeacher": "ON",
            "toSchool": "NO"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "ON"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A1(教師：Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "ON"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "ONO"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "ONO"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "NONN",
            "toTeacher": "NO",
            "toSchool": "ON"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "NONNN",
            "toTeacher": "NO",
            "toSchool": "NOO"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "NOO"
          }
        }
      ]
    },
    {
      "id": 19,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "讓我意識到鞭之數十,驅之別院",
            "toTeacher": "none",
            "toSchool": "none"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "不同意",
            "5": "不同意",
            "6": "普通",
            "7": "同意",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "額外單字好多",
            "toTeacher": "none",
            "toSchool": "none"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "挺費腦的",
            "toTeacher": "none",
            "toSchool": "none"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "當故事聽很好",
            "toTeacher": "none",
            "toSchool": "none"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "老師很幽默喔",
            "toTeacher": "none",
            "toSchool": "none"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "社會安全",
            "toTeacher": "none",
            "toSchool": "none"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "老師生動的表演很好看",
            "toTeacher": "none",
            "toSchool": "none"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A1(教師：Chad)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "全英文",
            "toTeacher": "none",
            "toSchool": "none"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "none",
            "toTeacher": "none",
            "toSchool": "none"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "none",
            "toTeacher": "none",
            "toSchool": "none"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "none",
            "toTeacher": "none",
            "toSchool": "none"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "普通",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "none",
            "toTeacher": "none",
            "toSchool": "none"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "普通",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "none",
            "toTeacher": "none",
            "toSchool": "none"
          }
        }
      ]
    },
    {
      "id": 20,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "會了很多成語",
            "toTeacher": "國文超級強",
            "toSchool": "。。。。。。。。"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "你的發音可以在標準一點",
            "toSchool": "。。。。。。。。。。"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多關於數學的問題",
            "toTeacher": "夯爆了",
            "toSchool": "夯爆了"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "不同意",
            "6": "普通",
            "7": "普通",
            "8": "不同意",
            "9": "普通",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "。。。。。。。。。",
            "toTeacher": "讚",
            "toSchool": "。。。。。。。。。"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "。。。。。。。。。。。",
            "toTeacher": "韓德森非常幽默，下次可以cos哆啦A夢",
            "toSchool": "。。。。。。。。。。。"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "。。。。。。。。",
            "toTeacher": "。。。。。。。。。。",
            "toSchool": "。。。。。。。。。"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "。。。。。。。",
            "toTeacher": "前額葉發達",
            "toSchool": "。。。。。。。。。"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A+(教師：Gina)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "。。。。。。。",
            "toTeacher": "Very good",
            "toSchool": "。。。。。。。。"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "。。。。。。。",
            "toTeacher": "夯爆了",
            "toSchool": "。。。。。。。"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "。。。。。。。。。。",
            "toTeacher": "謝謝你一職讓我們聊天",
            "toSchool": "。。。。。。。。。。"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "夯爆了",
            "toTeacher": "夯爆了",
            "toSchool": "夯爆了"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "。。。。。。。",
            "toTeacher": "。。。。。。。",
            "toSchool": "。。。。。。。。"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "拉玩了",
            "toTeacher": "拉玩了+",
            "toSchool": "拉玩了++"
          }
        }
      ]
    },
    {
      "id": 21,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "同意",
            "3": "不同意",
            "4": "同意",
            "5": "普通",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "不同意",
            "2": "普通",
            "3": "不同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "普通",
            "8": "普通",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A1(教師：Chad)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝",
            "toSchool": "沒有沒有"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝",
            "toSchool": "沒有"
          }
        }
      ]
    },
    {
      "id": 23,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "普通",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "詩好難",
            "toTeacher": "老師很棒",
            "toSchool": "老師很棒"
          }
        },
        {
          "subject": "英文",
          "teacher": "邱千芸",
          "group": "A3(教師：邱千芸)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "糖果好吃",
            "toTeacher": "老師很棒",
            "toSchool": "老師很棒"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "1,4課好難",
            "toTeacher": "老師很棒",
            "toSchool": "老師很棒"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "好玩",
            "toTeacher": "老師很棒",
            "toSchool": "老師很棒"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "哆啦A夢",
            "toTeacher": "老師很棒",
            "toSchool": "老師很棒"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "壓力最小",
            "toTeacher": "老師很棒",
            "toSchool": "老師很棒"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "嚴格",
            "toTeacher": "老師很棒,但很嚴格",
            "toSchool": "老師很棒"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A2(教師：Roja)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "不同意",
            "4": "普通",
            "5": "同意",
            "6": "普通",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "聽不懂",
            "toTeacher": "老師很棒",
            "toSchool": "老師很棒"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "更會ai",
            "toTeacher": "老師很棒",
            "toSchool": "老師很棒"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很棒,很吵",
            "toTeacher": "老師很棒",
            "toSchool": "老師很棒"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "老師很棒",
            "toSchool": "老師很棒"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很喜歡",
            "toTeacher": "老師很棒",
            "toSchool": "老師很棒"
          }
        },
        {
          "subject": "本土語",
          "teacher": "古靜宜",
          "group": "手語(教師：古靜宜)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "手語超棒",
            "toTeacher": "老師很棒",
            "toSchool": "老師很棒"
          }
        }
      ]
    },
    {
      "id": 24,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "我學會了文言文",
            "toTeacher": "我給你買個橘子",
            "toSchool": "文言文好難"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "不同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "獲益良多",
            "toTeacher": "老師你太幽默了",
            "toSchool": "英文好簡單"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "不同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到數學的各種知識",
            "toTeacher": "教得不錯",
            "toSchool": "我非常慶幸學到了生活中不會用到的二元一次方程式和一元一次不等式"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "不同意",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "我學到了如何在課堂中使出白色恐怖",
            "toTeacher": "教得不錯",
            "toSchool": "感謝學校教我20世紀(用不到)的各種歷史"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "我學到了(用不到)的工業區位和其他東西",
            "toTeacher": "您太幽默了，教學還cos 哆啦a夢",
            "toSchool": "好難"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到很多東西",
            "toTeacher": "教得不錯",
            "toSchool": "好難"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到了很多生物知識",
            "toTeacher": "老師您跳舞很好看",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A+(教師：Gina)",
          "ratings": {
            "1": "不同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "I learned a lot in ESL",
            "toTeacher": "Nothing",
            "toSchool": "`Nothing"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到用木板做東西",
            "toTeacher": "木工很有趣",
            "toSchool": "沒"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "沒",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "運動很開心",
            "toTeacher": "希望多上羽球或籃球",
            "toSchool": "體育課很有趣"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到很多",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "不同意",
            "2": "同意",
            "3": "同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "學到閩南語",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        }
      ]
    },
    {
      "id": 25,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "如何讀國語文",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "閱讀理解有提升",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "寫了很多題型",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "如何製作筆記",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "普通",
            "8": "同意",
            "9": "普通",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "普通",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "普通",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A1(教師：Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "普通",
            "5": "非常同意",
            "6": "非常同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "普通",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "普通",
            "8": "非常同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "同意",
            "4": "普通",
            "5": "普通",
            "6": "非常同意",
            "7": "普通",
            "8": "非常同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        }
      ]
    },
    {
      "id": 26,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "國文",
            "toTeacher": "注釋背不起來",
            "toSchool": "我很棒"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "英文",
            "toTeacher": "老師特別善良",
            "toSchool": "我很好"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "數學",
            "toTeacher": "老師好兇很喜歡",
            "toSchool": "數學廢了"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "歷史",
            "toTeacher": "年份好難記",
            "toSchool": "歷史好多死人"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地理",
            "toTeacher": "岩漿噴發",
            "toSchool": "嚴厲斥責"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "公民",
            "toTeacher": "我公民超好",
            "toSchool": "拉爆了"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "生物",
            "toTeacher": "我生物超好",
            "toSchool": "我很棒"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A1(教師：Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文",
            "toTeacher": "老師很好",
            "toSchool": "我很好"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "電腦",
            "toTeacher": "老師很好",
            "toSchool": "我很好"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "0",
            "toTeacher": "爛死了",
            "toSchool": "我很乖"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "體育",
            "toTeacher": "老師很棒",
            "toSchool": "我很棒"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "跟我道歉",
            "toTeacher": "跟我道歉",
            "toSchool": "跟我道歉"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "0",
            "toTeacher": "爛死了",
            "toSchool": "老師好兇"
          }
        }
      ]
    },
    {
      "id": 27,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "讓我變得更有文學素養",
            "toTeacher": "老師我去給妳買個橘子             日知其所亡  月無忘其所能",
            "toSchool": "非常感激"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "英文更優良",
            "toTeacher": "老師您真是太認真了",
            "toSchool": "非常感激"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "學會如何看時速",
            "toTeacher": "老師您心胸太寬廣了吧",
            "toSchool": "非常感激"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "希特勒",
            "toTeacher": "積進",
            "toSchool": "非常感激"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "看地圖",
            "toTeacher": "您太幽默了",
            "toSchool": "非常感激"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "======= 公民科回饋 ========\n*\n教師：吳雯菁\n非常同意\t同意\t普通\t不同意\t非常不同意\n我會在課前預習或課後複習上課的內容。\t\n我每次上課會準時出席，並且認真聽講。\t\n我會主動提出問題、解決問題。\t\n老師的教學內容份量適中。\t\n老師的教學內容難易度適中。\t\n老師的教學方法能讓我有效學習。\t\n老師的教學態度認真負責。\t\n老師的評量能幫助我了解自己的學習狀況。\t\n師生關係相處融洽。\t\n綜合而言，我對這門課的教學效果滿意且很有收穫。\t\n我會在課前預習或課後複習上課的內容。\t\n我每次上課會準時出席，並且認真聽講。\t\n我會主動提出問題、解決問題。\t\n老師的教學內容份量適中。\t\n老師的教學內容難易度適中。\t\n老師的教學方法能讓我有效學習。\t\n老師的教學態度認真負責。\t\n老師的評量能幫助我了解自己的學習狀況。\t\n師生關係相處融洽。\t\n綜合而言，我對這門課的教學效果滿意且很有收穫。\t\n公民科 - (一) 本課程我的收穫：\n*",
            "toTeacher": "太幽默了",
            "toSchool": "====== 公民科回饋 ========\n*\n教師：吳雯菁\n非常同意\t同意\t普通\t不同意\t非常不同意\n我會在課前預習或課後複習上課的內容。\t\n我每次上課會準時出席，並且認真聽講。\t\n我會主動提出問題、解決問題。\t\n老師的教學內容份量適中。\t\n老師的教學內容難易度適中。\t\n老師的教學方法能讓我有效學習。\t\n老師的教學態度認真負責。\t\n老師的評量能幫助我了解自己的學習狀況。\t\n師生關係相處融洽。\t\n綜合而言，我對這門課的教學效果滿意且很有收穫。\t\n我會在課前預習或課後複習上課的內容。\t\n我每次上課會準時出席，並且認真聽講。\t\n我會主動提出問題、解決問題。\t\n老師的教學內容份量適中。\t\n老師的教學內容難易度適中。\t\n老師的教學方法能讓我有效學習。\t\n老師的教學態度認真負責。\t\n老師的評量能幫助我了解自己的學習狀況。\t\n師生關係相處融洽。"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "認識自己",
            "toTeacher": "太認真了老師",
            "toSchool": "非常感激"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A2(教師：Roja)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "講英文",
            "toTeacher": "我對這門課的教學效果滿意且很有收穫。",
            "toSchool": "感激"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "老師的教學方法能讓我有效學習。",
            "toTeacher": "我對這門課的教學效果滿意且很有收穫。",
            "toSchool": "感激"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "師生關係相處融洽。",
            "toTeacher": "我對這門課的教學效果滿意且很有收穫。",
            "toSchool": "感激"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "師生關係相處融洽。",
            "toTeacher": "師生關係相處融洽。",
            "toSchool": "感激"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "老師的教學態度認真負責。",
            "toTeacher": "老師的教學態度認真負責。",
            "toSchool": ""
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        }
      ]
    },
    {
      "id": 28,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "我會主動提出問題、解決問題。",
            "toTeacher": "師生關係相處融洽。",
            "toSchool": "綜合而言，我對這門課的教學效果滿意且很有收穫"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "綜合而言，我對這門課的教學效果滿意且很有收穫",
            "toTeacher": "老師的評量能幫助我了解自己的學習狀況。",
            "toSchool": "綜合而言，我對這門課的教學效果滿意且很有收穫。"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "我會在課前預習或課後複習上課的內容。\t\n我每次上課會準時出席，並且認真聽講。\t\n我會主動提出問題、解決問題。\t\n老師的教學內容份量適中。\t\n老師的教學內容難易度適中。\t\n老師的教學方法能讓我有效學習。\t\n老師的教學態度認真負責。\t\n老師的評量能幫助我了解自己的學習狀況。\t\n師生關係相處融洽。\t\n綜合而言，我對這門課的教學效果滿意且很有收穫。",
            "toTeacher": "我會在課前預習或課後複習上課的內容。\t\n我每次上課會準時出席，並且認真聽講。\t\n我會主動提出問題、解決問題。\t\n老師的教學內容份量適中。\t\n老師的教學內容難易度適中。\t\n老師的教學方法能讓我有效學習。\t\n老師的教學態度認真負責。\t\n老師的評量能幫助我了解自己的學習狀況。\t\n師生關係相處融洽。\t\n綜合而言，我對這門課的教學效果滿意且很有收穫。",
            "toSchool": "我會在課前預習或課後複習上課的內容。\t\n我每次上課會準時出席，並且認真聽講。\t\n我會主動提出問題、解決問題。\t\n老師的教學內容份量適中。\t\n老師的教學內容難易度適中。\t\n老師的教學方法能讓我有效學習。\t\n老師的教學態度認真負責。\t\n老師的評量能幫助我了解自己的學習狀況。\t\n師生關係相處融洽。\t\n綜合而言，我對這門課的教學效果滿意且很有收穫。"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "綜合而言，我對這門課的教學效果滿意且很有收穫。",
            "toTeacher": "老師的教學態度認真負責。",
            "toSchool": "老師的評量能幫助我了解自己的學習狀況。"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "綜合而言，我對這門課的教學效果滿意且很有收穫",
            "toTeacher": "老師的教學態度認真負責。",
            "toSchool": "老師的評量能幫助我了解自己的學習狀況。"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "綜合而言，我對這門課的教學效果滿意且很有收穫",
            "toTeacher": "老師的教學態度認真負責。",
            "toSchool": "老師的評量能幫助我了解自己的學習狀況。"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "同意",
            "4": "普通",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "綜合而言，我對這門課的教學效果滿意且很有收穫",
            "toTeacher": "老師的教學態度認真負責。",
            "toSchool": "老師的評量能幫助我了解自己的學習狀況。"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A1(教師：Chad)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "綜合而言，我對這門課的教學效果滿意且很有收穫",
            "toTeacher": "老師的教學態度認真負責。",
            "toSchool": "老師的評量能幫助我了解自己的學習狀況。"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "綜合而言，我對這門課的教學效果滿意且很有收穫",
            "toTeacher": "老師的教學態度認真負責。",
            "toSchool": "老師的評量能幫助我了解自己的學習狀況。"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "綜合而言，我對這門課的教學效果滿意且很有收穫",
            "toTeacher": "老師的教學態度認真負責。",
            "toSchool": "老師的評量能幫助我了解自己的學習狀況。"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "綜合而言，我對這門課的教學效果滿意且很有收穫",
            "toTeacher": "老師的教學態度認真負責。",
            "toSchool": "老師的評量能幫助我了解自己的學習狀況。"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "綜合而言，我對這門課的教學效果滿意且很有收穫",
            "toTeacher": "老師的教學態度認真負責。",
            "toSchool": "老師的評量能幫助我了解自己的學習狀況。"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "綜合而言，我對這門課的教學效果滿意且很有收穫",
            "toTeacher": "老師的教學態度認真負責。",
            "toSchool": "老師的評量能幫助我了解自己的學習狀況。"
          }
        }
      ]
    },
    {
      "id": 30,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "不同意",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "可以吸收到很多職事",
            "toTeacher": "老師妳辛苦了",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "英文",
          "teacher": "邱千芸",
          "group": "A3(教師：邱千芸)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "可以學習到很多英文單字",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "數學",
          "teacher": "桂松山",
          "group": "B(教師：桂松山)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Sandra",
          "group": "B(教師：Sandra)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "老師辛苦了",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "老師辛苦了",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "不同意",
            "4": "不同意",
            "5": "不同意",
            "6": "不同意",
            "7": "不同意",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        }
      ]
    },
    {
      "id": 31,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "普通",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "老師都會補充很多我們不認識的詞語，讓我們又多了一個知識!",
            "toTeacher": "老師都很認真上課",
            "toSchool": "普通"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "老師跟國文老師一樣，都會補充一些我們不會的單字",
            "toTeacher": "老師補充的單字讓我刻在腦海中，並且用在生活",
            "toSchool": "沒有ㄟ"
          }
        },
        {
          "subject": "數學",
          "teacher": "桂松山",
          "group": "B(教師：桂松山)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "我的數學小考有慢慢的進步原本2.30分現在是40多漸漸地又變成50多讓我感到開心又很有成就感!",
            "toTeacher": "老師都會走下台看我們寫的進度，並且在我們有錯誤的時候，告訴我們怎麼改正",
            "toSchool": "沒有ㄟ"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "有時候就是看運氣(成績)",
            "toTeacher": "老師都會用一節課的時間把進度趕完，怕下一次上課我們又會忘記!",
            "toSchool": "沒有ㄟ"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "同意",
            "5": "普通",
            "6": "同意",
            "7": "非常同意",
            "8": "普通",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "這項課程我真的沒辦法，但我會努力!",
            "toTeacher": "老師上課都很有趣",
            "toSchool": "沒有ㄟ"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "我對這項課程很ok，水準通常都在70多",
            "toTeacher": "老師在課前會以遊戲的方式來問答",
            "toSchool": "沒有ㄟ"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "有進步",
            "toTeacher": "沒有ㄟ",
            "toSchool": "沒有ㄟ沒有ㄟ"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A2(教師：Roja)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文對我來說是可以的，所以還行",
            "toTeacher": "我們上台時，自己親手做了法式等...，謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "有親手體驗木工",
            "toTeacher": "謝謝",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "有運動到",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "普通",
            "8": "同意",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "同意",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 32,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "滿多",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多\\",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A1(教師：Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "古靜宜",
          "group": "手語(教師：古靜宜)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 33,
      "className": "7A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "我知道更多的知識還有絕句律詩核新詩的差別",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "老師非常好"
          }
        },
        {
          "subject": "英文",
          "teacher": "邱千芸",
          "group": "A3(教師：邱千芸)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "知道了更多的英文知識",
            "toTeacher": "謝謝老師",
            "toSchool": "老師非常好"
          }
        },
        {
          "subject": "數學",
          "teacher": "桂松山",
          "group": "B(教師：桂松山)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "進步了",
            "toTeacher": "謝謝老師",
            "toSchool": "no"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "知道了更多",
            "toTeacher": "謝謝",
            "toSchool": "no"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Sandra",
          "group": "B(教師：Sandra)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "本土語",
          "teacher": "曾淑汝",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        }
      ]
    },
    {
      "id": 34,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "成語",
            "toTeacher": "老師很好，教學很認真",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "文法、單字",
            "toTeacher": "老師很有趣",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "方程式",
            "toTeacher": "老師很認真地學",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "老師很認真",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "生態系",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A2(教師：Roja)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "口說",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 35,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "文言文",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "單字",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "xy",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "日本時代",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "不同意",
            "4": "同意",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無無",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "同意",
            "4": "普通",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Sandra",
          "group": "B(教師：Sandra)",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "拍",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "籃球",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "演講",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 36,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "good",
            "toTeacher": "good",
            "toSchool": "good"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "good",
            "toTeacher": "doog",
            "toSchool": "good"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "good",
            "toTeacher": "goon",
            "toSchool": "good"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "eh",
            "toTeacher": "eh",
            "toSchool": "eh"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "he",
            "toTeacher": "he",
            "toSchool": "he"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "不同意",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "普通",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "ehe",
            "toTeacher": "eh",
            "toSchool": "eh"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "he",
            "toTeacher": "he",
            "toSchool": "he"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A+(教師：Gina)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "nice",
            "toTeacher": "nice",
            "toSchool": "nice"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "bad",
            "toTeacher": "bad",
            "toSchool": "bad"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "eh",
            "toTeacher": "eh",
            "toSchool": "eh"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "he",
            "toTeacher": "he",
            "toSchool": "he"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "he",
            "toTeacher": "he",
            "toSchool": "he"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "very bad",
            "toTeacher": "very bad",
            "toSchool": "very bad"
          }
        }
      ]
    },
    {
      "id": 37,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "如何做木工作品",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "英文",
          "teacher": "邱千芸",
          "group": "A3(教師：邱千芸)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "英文知識",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "數學知識",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "歷史知識",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "地理知識",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "公民知識",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "生物知識",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Sandra",
          "group": "B(教師：Sandra)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "esl知識",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "科技知識",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "音樂知識",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "體育知識",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "生命知識",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "本土語知識",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        }
      ]
    },
    {
      "id": 38,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "普通",
            "6": "普通",
            "7": "非常同意",
            "8": "同意",
            "9": "普通",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "NO"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "NO"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "NO"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "同意",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "同意",
            "8": "普通",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "NO"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "普通",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "NO"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "NO"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A2(教師：Roja)",
          "ratings": {
            "1": "不同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "NO"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "NO"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "NO"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "NO"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "同意",
            "5": "非常同意",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "NO"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "不同意",
            "4": "不同意",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "NO",
            "toTeacher": "NO",
            "toSchool": "NO"
          }
        }
      ]
    },
    {
      "id": 39,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "普通",
            "3": "不同意",
            "4": "不同意",
            "5": "普通",
            "6": "普通",
            "7": "不同意",
            "8": "不同意",
            "9": "普通",
            "10": "不同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "不同意",
            "8": "普通",
            "9": "普通",
            "10": "不同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "同意",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "同意",
            "4": "普通",
            "5": "同意",
            "6": "普通",
            "7": "不同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "普通",
            "3": "不同意",
            "4": "不同意",
            "5": "普通",
            "6": "普通",
            "7": "不同意",
            "8": "普通",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "同意",
            "4": "普通",
            "5": "普通",
            "6": "不同意",
            "7": "普通",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A1(教師：Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "普通",
            "3": "不同意",
            "4": "不同意",
            "5": "普通",
            "6": "不同意",
            "7": "普通",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "不同意",
            "7": "不同意",
            "8": "普通",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "不同意",
            "3": "普通",
            "4": "普通",
            "5": "不同意",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "不同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        }
      ]
    },
    {
      "id": 41,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "不同意",
            "3": "普通",
            "4": "普通",
            "5": "不同意",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "不同意",
            "4": "不同意",
            "5": "不同意",
            "6": "普通",
            "7": "不同意",
            "8": "普通",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "不同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "普通",
            "4": "同意",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "同意",
            "9": "普通",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "非常同意",
            "4": "同意",
            "5": "普通",
            "6": "不同意",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A+(教師：Gina)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "不同意",
            "3": "不同意",
            "4": "不同意",
            "5": "不同意",
            "6": "普通",
            "7": "同意",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "同意",
            "6": "普通",
            "7": "不同意",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "不同意",
            "4": "不同意",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "不同意",
            "4": "不同意",
            "5": "不同意",
            "6": "普通",
            "7": "普通",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        }
      ]
    },
    {
      "id": 43,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "文字",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "邱千芸",
          "group": "A3(教師：邱千芸)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "句子",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "公式",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "228",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "地形",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "公民",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "動物",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A2(教師：Roja)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "英文",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "節奏",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "籃球",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "生命",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 44,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "知識",
            "toTeacher": "謝謝教導",
            "toSchool": "繼續努力"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "額外知識",
            "toTeacher": "謝謝老師的督促",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒收穫",
            "toTeacher": "謝謝老師",
            "toSchool": "普通"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "歷史線",
            "toTeacher": "感謝教導",
            "toSchool": "普通"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A+(教師：Gina)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "休閒",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "有趣",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "人生大道理",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 45,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "普通",
            "8": "同意",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "桂松山",
          "group": "B(教師：桂松山)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "不同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A1(教師：Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "普通",
            "5": "不同意",
            "6": "不同意",
            "7": "不同意",
            "8": "不同意",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "普通",
            "3": "非常同意",
            "4": "普通",
            "5": "非常同意",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "非常同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 46,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "英文單字",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "台灣歷史",
            "toTeacher": "謝謝",
            "toSchool": ""
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地形 交通",
            "toTeacher": "謝謝",
            "toSchool": ""
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "公平正義",
            "toTeacher": "謝謝",
            "toSchool": ""
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A+(教師：Gina)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文知識",
            "toTeacher": "thank you",
            "toSchool": ""
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "負責",
            "toTeacher": "",
            "toSchool": ""
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "",
            "toTeacher": "",
            "toSchool": ""
          }
        }
      ]
    },
    {
      "id": 47,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "文言文",
            "toTeacher": "無",
            "toSchool": "吳"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "文法",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "未知數",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "歷史",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地理",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "公民",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "生物",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A1(教師：Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 48,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "學會了很多的生字",
            "toTeacher": "謝謝你",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "普通",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "過去式",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "一元元一次不等式",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "台灣史",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "台灣地理位置",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "公平正義",
            "toTeacher": "老師再見",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "生物界",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A2(教師：Roja)",
          "ratings": {
            "1": "不同意",
            "2": "普通",
            "3": "同意",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "普通",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "表達能力",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "製作平台",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "樂譜",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "排球規則",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "同意",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "不心存僥倖",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "普通",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "唱閩南語歌",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 49,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "請給多億點會考題",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "香水味很重",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "不同意",
            "5": "不同意",
            "6": "普通",
            "7": "不同意",
            "8": "不同意",
            "9": "普通",
            "10": "不同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常不同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "飲料價格提高",
            "toSchool": "老師很好"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A+(教師：Gina)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 50,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "同意",
            "8": "非常同意",
            "9": "普通",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "許多的國文知識",
            "toTeacher": "謝謝",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "補充的英文知識",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常不同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "講解很有用",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很有意思",
            "toTeacher": "謝謝老師教得很好",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到如何瞭解地理",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "不同意",
            "7": "同意",
            "8": "不同意",
            "9": "普通",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "成為一個正常的公民",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學會許多生物",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A1(教師：Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "如何學習",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "如何鋸木頭",
            "toTeacher": "很有趣",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "排球常識",
            "toTeacher": "謝謝",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "不同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "生命教育",
            "toTeacher": "謝謝校長",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "台灣國語講<讀<寫",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 51,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到了很多知識",
            "toTeacher": "老師謝謝您",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到了更多知識",
            "toTeacher": "老師謝謝您",
            "toSchool": "很好"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "變聰明了",
            "toTeacher": "老教得很好",
            "toSchool": "很好"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學了很多我們不知道的歷史",
            "toTeacher": "謝謝您",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學了很多我不知道的東西",
            "toTeacher": "謝謝您",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學了很多東西",
            "toTeacher": "謝謝您",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學了很多東西",
            "toTeacher": "老師謝謝您",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A1(教師：Chad)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學了很多我不知道的單字",
            "toTeacher": "謝謝您",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學了很多東西",
            "toTeacher": "謝謝您",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學了很多我不知道的音符",
            "toTeacher": "謝謝您",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到了很多我不知道的規則",
            "toTeacher": "謝謝您",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學了很多念書方法",
            "toTeacher": "謝謝您",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學了很多我不知道的知識",
            "toTeacher": "謝謝您",
            "toSchool": "很棒"
          }
        }
      ]
    },
    {
      "id": 52,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "邱千芸",
          "group": "A3(教師：邱千芸)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A2(教師：Roja)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "不同意",
            "4": "不同意",
            "5": "不同意",
            "6": "不同意",
            "7": "普通",
            "8": "普通",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "不同意",
            "4": "不同意",
            "5": "不同意",
            "6": "不同意",
            "7": "不同意",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 53,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多語文知識",
            "toTeacher": "謝謝",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "英文",
          "teacher": "邱千芸",
          "group": "A3(教師：邱千芸)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文知識 做人道理",
            "toTeacher": "謝謝",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "數學知識",
            "toTeacher": "謝謝",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "歷史知識",
            "toTeacher": "謝謝",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地理知識",
            "toTeacher": "謝謝",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "普通",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "公民知識",
            "toTeacher": "謝謝",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "同意",
            "4": "普通",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "生物知識",
            "toTeacher": "謝謝",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A2(教師：Roja)",
          "ratings": {
            "1": "非常不同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "不同意",
            "6": "非常不同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "英語交流知識",
            "toTeacher": "謝謝",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "電腦知識",
            "toTeacher": "謝謝",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "音樂知識",
            "toTeacher": "謝謝",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "體育規則",
            "toTeacher": "謝謝",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "道理",
            "toTeacher": "謝謝",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "本土語",
          "teacher": "張秀玫",
          "group": "客家語(教師：張秀玫)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "客語知識",
            "toTeacher": "謝謝",
            "toSchool": "謝謝"
          }
        }
      ]
    },
    {
      "id": 54,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "非常不同意",
            "4": "同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "普通",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到許多我以前不知道的是不知道的是",
            "toTeacher": "謝謝老師願意忍受我們上課吵架的 態度,依然不放棄我們",
            "toSchool": "學校的環境常好"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "不同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到許知識",
            "toTeacher": "謝謝老師的教導 我的英文變好了",
            "toSchool": "好的無可挑剔"
          }
        },
        {
          "subject": "數學",
          "teacher": "桂松山",
          "group": "B(教師：桂松山)",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學會許多算式",
            "toTeacher": "老師人非常親切非常親切",
            "toSchool": "非常好"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "非常不同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "了解到很多歷史",
            "toTeacher": "謝謝",
            "toSchool": "很好"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "非常不同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多多多知識",
            "toTeacher": "地理好難",
            "toSchool": "嗚嗚嗚"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "不同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "公共規則",
            "toTeacher": "謝謝老師 我會想你 非常想",
            "toSchool": "老師人很很好"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "許多知識",
            "toTeacher": "很幽默喔",
            "toSchool": "很好"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A2(教師：Roja)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "日常對話",
            "toTeacher": "謝謝你",
            "toSchool": "很好"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常不同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "111",
            "toTeacher": "謝寫",
            "toSchool": "很好"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很好",
            "toTeacher": "很好",
            "toSchool": "很好"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很好",
            "toTeacher": "很好",
            "toSchool": "很好"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很好",
            "toTeacher": "很好",
            "toSchool": "很好"
          }
        },
        {
          "subject": "本土語",
          "teacher": "古靜宜",
          "group": "手語(教師：古靜宜)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很好",
            "toTeacher": "很好",
            "toSchool": "很好"
          }
        }
      ]
    },
    {
      "id": 55,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "國文綜合能力",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "英文表達能力",
            "toTeacher": "Thank You Teacher",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "數學綜合能力",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "歷史能力",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "地理綜合能力",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "公民綜合能力",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "生物能力",
            "toTeacher": "謝謝老師",
            "toSchool": "無˙"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A1(教師：Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "英文表達能力",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "手做能力",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "音樂能力",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "體育能力",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "生命教育",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "本土語",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 57,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "國文",
            "toTeacher": "good",
            "toSchool": "沒"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文",
            "toTeacher": "good",
            "toSchool": "沒"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "非常同意",
            "4": "同意",
            "5": "普通",
            "6": "普通",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "1+1=2",
            "toTeacher": "不知道",
            "toSchool": "沒"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "歷史",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "地理",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "公民",
            "toTeacher": "老師上的課我們都很安靜 老師掰掰",
            "toSchool": "沒"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "生物",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A1(教師：Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常同意",
            "4": "普通",
            "5": "普通",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "用電腦",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "音樂",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "體育",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "生命",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "閩南語",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        }
      ]
    },
    {
      "id": 58,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多課堂以外筆記",
            "toTeacher": "我覺得她很認真地教我們",
            "toSchool": "沒話"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "除了課本以外的沒什麼收穫",
            "toTeacher": "不知道",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "蠻清楚的",
            "toTeacher": "老師教得很仔細",
            "toSchool": "沒"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "沒",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "很努力",
            "toSchool": "很好"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "沒",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多知識",
            "toTeacher": "進度好快而且好兇",
            "toSchool": "我覺得老師其實教的恨努力"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A+(教師：Gina)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "老師人很好",
            "toSchool": "沒"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "完全沒有",
            "toTeacher": "你的聲音真的超小聲而且也都不知道在幹嘛?",
            "toSchool": "沒"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "老師人很好",
            "toSchool": "沒"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "沒",
            "toTeacher": "很追眠",
            "toSchool": "沒"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "沒",
            "toTeacher": "嘴很臭",
            "toSchool": "沒"
          }
        }
      ]
    },
    {
      "id": 59,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "可以懂很多古代知識很多古代知識",
            "toTeacher": "謝謝老師這一學期的教導",
            "toSchool": "知識豐富"
          }
        },
        {
          "subject": "英文",
          "teacher": "邱千芸",
          "group": "A3(教師：邱千芸)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "懂英語許多的文法",
            "toTeacher": "謝謝你教我英文的用法",
            "toSchool": "謝謝學校的英語課程讓我學好英文"
          }
        },
        {
          "subject": "數學",
          "teacher": "桂松山",
          "group": "B(教師：桂松山)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "有點難",
            "toTeacher": "雖然不會但還是謝謝老師的用心教導",
            "toSchool": "謝謝學校讓我把數學學好3Q"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "不錯",
            "toTeacher": "謝謝老師讓我學到古代的歷史",
            "toSchool": "可以學到很多知識"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "教得很不錯",
            "toTeacher": "讓我學到地形的知識",
            "toSchool": "還不錯"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "還OK",
            "toTeacher": "謝謝這一年教導",
            "toSchool": "呃.........還行"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "生物食物鏈的用法機知識",
            "toTeacher": "謝謝你用心腳導我們",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Sandra",
          "group": "B(教師：Sandra)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英語的用途",
            "toTeacher": "SO GoodXD",
            "toSchool": "So fun"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "非常好玩",
            "toTeacher": "很有趣",
            "toSchool": "很好"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "有趣",
            "toTeacher": "謝謝你喔",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "有趣",
            "toTeacher": "很棒",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "還好",
            "toTeacher": "謝謝你教我人生的道理",
            "toSchool": "很不錯"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "還好",
            "toTeacher": "謝謝",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 60,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "文言文",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝所有老師"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "單字量增加",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝所有老師"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "會算x了",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝所有老師"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "中國歷史",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝所有老師"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "台灣地形",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝所有老師"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "法規",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝所有老師"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "身體構造",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝所有老師"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A+(教師：Gina)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "不認識的單字量增加了",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝所有老師"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "用程式",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝所有老師"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "打節奏",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝所有老師"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "羽球",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝所有老師"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "分配時間",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝所有老師"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "說",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝所有老師"
          }
        }
      ]
    },
    {
      "id": 61,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "不同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "不同意",
            "9": "同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "可以懂得古代",
            "toTeacher": "謝謝老師辛苦教學",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "教得很好",
            "toTeacher": "謝謝",
            "toSchool": "英文課讓我學到很多"
          }
        },
        {
          "subject": "數學",
          "teacher": "桂松山",
          "group": "B(教師：桂松山)",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "同意",
            "4": "同意",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "同意",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "教得好",
            "toTeacher": "謝謝教數學",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "同意",
            "4": "同意",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "有點難",
            "toTeacher": "謝謝老師教我們古代",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "同意",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "普通",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "教的好",
            "toTeacher": "謝謝教我地形",
            "toSchool": "以後還讓他當"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "普通",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "教得好",
            "toTeacher": "很好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "普通",
            "6": "同意",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "謝謝教我們生物",
            "toTeacher": "教得好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A1(教師：Chad)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "謝謝",
            "toTeacher": "thank you for teaching us some difficult words",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "好玩",
            "toTeacher": "謝謝",
            "toSchool": "還好"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "同意",
            "4": "同意",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "有趣",
            "toTeacher": "好玩",
            "toSchool": "還好"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "普通",
            "3": "同意",
            "4": "同意",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "有點難",
            "toTeacher": "好玩但容易受傷",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "不同意",
            "8": "普通",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "還好",
            "toTeacher": "謝謝",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "好好玩",
            "toTeacher": "謝謝",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 62,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我的背注釋能力變強",
            "toTeacher": "您辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "邱千芸",
          "group": "A3(教師：邱千芸)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "現在會的單字變多了",
            "toTeacher": "您辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "綜合成績變好",
            "toTeacher": "您辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "綜合成績變好",
            "toTeacher": "您辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "綜合成績變好",
            "toTeacher": "您辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "綜合成績變好",
            "toTeacher": "您辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "綜合成績變好",
            "toTeacher": "您辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Sandra",
          "group": "B(教師：Sandra)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "綜合成績變好",
            "toTeacher": "您辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "綜合成績變好",
            "toTeacher": "您辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "綜合成績變好",
            "toTeacher": "您辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "綜合成績變好",
            "toTeacher": "您辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "綜合成績變好",
            "toTeacher": "您辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "不同意",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "綜合成績變好",
            "toTeacher": "您辛苦了",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 63,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "I learned lots of new things, I really love this subject.",
            "toTeacher": "You taught very well.",
            "toSchool": "Good!"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A1(教師：羅雅苓)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "普通",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "I was happy during the class time.",
            "toTeacher": "Good!",
            "toSchool": "Good!"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "非常同意",
            "2": "普通",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "普通",
            "8": "同意",
            "9": "非常同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "I always learn by myself.",
            "toTeacher": "Bye Bye!",
            "toSchool": "Good!"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "普通",
            "5": "同意",
            "6": "普通",
            "7": "普通",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "I learned Taiwan's history.",
            "toTeacher": "Teacher helped me learned Taiwan's history.",
            "toSchool": "Good!"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "I learned lots of new things.",
            "toTeacher": "Good job!",
            "toSchool": "Good!"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "I'll be a great citizen in the future.",
            "toTeacher": "Good!",
            "toSchool": "Good!"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "I leaned many basic biology knowledge.",
            "toTeacher": "He taught very well!",
            "toSchool": "Good!"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A+(教師：Gina)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "同意",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "English speaking skills.",
            "toTeacher": "I had a lot of fun during ESL class.",
            "toSchool": "Good!"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "Knowledge about technology.",
            "toTeacher": "Good!",
            "toSchool": "Good!"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "普通",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "Music",
            "toTeacher": "Her voice is too small.",
            "toSchool": "Good!"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "PE",
            "toTeacher": "Too tired!",
            "toSchool": "I hope the new teacher is better."
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "Good!",
            "toTeacher": "Good!",
            "toSchool": "Good!"
          }
        },
        {
          "subject": "本土語",
          "teacher": "廖麗雪",
          "group": "閩南語(教師：A班-曾淑汝、B班-廖麗雪)",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "非常不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "No!",
            "toTeacher": "No!",
            "toSchool": "Bad!"
          }
        }
      ]
    },
    {
      "id": 64,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "越來越聰明",
            "toTeacher": "老師很好",
            "toSchool": "好的無可挑剔"
          }
        },
        {
          "subject": "英文",
          "teacher": "邱千芸",
          "group": "A3(教師：邱千芸)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "知道更多單字",
            "toTeacher": "我很喜歡千芸主任",
            "toSchool": "好的無可挑剔"
          }
        },
        {
          "subject": "數學",
          "teacher": "蔡佳玲",
          "group": "A(教師：蔡佳玲)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "公式",
            "toTeacher": "很棒",
            "toSchool": "好的無可挑剔"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "聊解更多歷史",
            "toTeacher": "老師很好",
            "toSchool": "好的無可挑剔"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到了時差",
            "toTeacher": "很好",
            "toSchool": "好的無可挑剔"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "知道很多法律和規則",
            "toTeacher": "很棒 希望老師在新的學校可以開心 我會想你的",
            "toSchool": "好的無可挑剔"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很有趣",
            "toTeacher": "很好玩 很有趣",
            "toSchool": "好的無可挑剔"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Sandra",
          "group": "B(教師：Sandra)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很喜歡",
            "toTeacher": "我很喜歡SANDRA",
            "toSchool": "好的無可挑剔"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很好玩",
            "toTeacher": "很好",
            "toSchool": "好的無可挑剔"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很喜歡",
            "toTeacher": "很好玩",
            "toSchool": "好的無可挑剔  但有億點吵"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學會打排球",
            "toTeacher": "很好",
            "toSchool": "很好"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很有趣 每次都學到老師想讓我們學到的不一樣的東西",
            "toTeacher": "很棒",
            "toSchool": "好的無可挑剔"
          }
        },
        {
          "subject": "本土語",
          "teacher": "古靜宜",
          "group": "手語(教師：古靜宜)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "C好玩",
            "toTeacher": "很棒",
            "toSchool": "好的無可挑剔"
          }
        }
      ]
    },
    {
      "id": 65,
      "className": "7B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "同意",
            "5": "普通",
            "6": "同意",
            "7": "非常同意",
            "8": "普通",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "很多國字跟註釋",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝每個老師"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "單字",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝每個老師"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "A+(教師：陳昱澐)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "我會算X怎麼解了",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝每個老師"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "台灣史",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝每個老師"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "台灣地形及氣候",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝每個老師"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "公民素養",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝每個老師"
          }
        },
        {
          "subject": "生物",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "生物圈",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝每個老師"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Sandra",
          "group": "B(教師：Sandra)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "普通",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "單字",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝每個老師"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "電腦",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝每個老師"
          }
        },
        {
          "subject": "音樂",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "節奏",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝每個老師"
          }
        },
        {
          "subject": "體育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "球技",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝每個老師"
          }
        },
        {
          "subject": "生命教育",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "規劃時間",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝每個老師"
          }
        },
        {
          "subject": "本土語",
          "teacher": "古靜宜",
          "group": "手語(教師：古靜宜)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "手語歌",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝每個老師"
          }
        }
      ]
    },
    {
      "id": 67,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝老師",
            "toSchool": "選得真好"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝老師",
            "toSchool": "選得真好"
          }
        },
        {
          "subject": "數學",
          "teacher": "蘇試",
          "group": "A+(教師：蘇試)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝老師",
            "toSchool": "選得真好"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝老師",
            "toSchool": "選得真好"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝老師",
            "toSchool": "選得真好"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝老師",
            "toSchool": "選得真好"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "讚",
            "toTeacher": "讚",
            "toSchool": "讚"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "讚",
            "toTeacher": "讚",
            "toSchool": "讚"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(Roja)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "讚",
            "toTeacher": "讚",
            "toSchool": "讚"
          }
        }
      ]
    },
    {
      "id": 68,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "非常同意",
            "8": "普通",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A3(教師：羅雅苓)",
          "ratings": {
            "1": "非常不同意",
            "2": "普通",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "普通",
            "7": "非常同意",
            "8": "非常不同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "我真不會英文",
            "toSchool": "我真的不會英文"
          }
        },
        {
          "subject": "數學",
          "teacher": "吳宇綸",
          "group": "A(教師：吳宇綸)",
          "ratings": {
            "1": "非常不同意",
            "2": "普通",
            "3": "非常不同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "不同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "我真的不會數學",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "普通",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "B(Gina)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 69,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "國文",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "英文",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "數學",
          "teacher": "吳宇綸",
          "group": "A(教師：吳宇綸)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "數學",
            "toTeacher": "沒有",
            "toSchool": "班上很吵"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "歷史",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "地理",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "公民",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "理化",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "電腦",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(Roja)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "esl",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        }
      ]
    },
    {
      "id": 70,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "國學常識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "文法增強",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "蘇試",
          "group": "A+(教師：蘇試)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "公式解解",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "加深認知",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "地理知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "公民",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "理化知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "電腦基礎應用",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "英語文加強",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 71,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "不同意",
            "4": "不同意",
            "5": "不同意",
            "6": "不同意",
            "7": "不同意",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "非常不同意",
            "2": "普通",
            "3": "不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "蘇試",
          "group": "A+(教師：蘇試)",
          "ratings": {
            "1": "非常同意",
            "2": "普通",
            "3": "不同意",
            "4": "普通",
            "5": "普通",
            "6": "不同意",
            "7": "不同意",
            "8": "非常同意",
            "9": "非常不同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 72,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "讚",
            "toTeacher": "謝謝老師",
            "toSchool": "讚"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "不同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "讚",
            "toTeacher": "謝謝老師",
            "toSchool": "讚"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "B(教師：陳昱澐)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "讚",
            "toTeacher": "謝謝老師",
            "toSchool": "讚"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "讚",
            "toTeacher": "謝謝老師",
            "toSchool": "讚"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "讚",
            "toTeacher": "謝謝老師",
            "toSchool": "讚"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "讚",
            "toTeacher": "謝謝老師",
            "toSchool": "讚"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "讚",
            "toTeacher": "謝謝老師",
            "toSchool": "讚"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "讚",
            "toTeacher": "謝謝老師",
            "toSchool": "讚"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(Roja)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "讚",
            "toTeacher": "謝謝老師",
            "toSchool": "讚"
          }
        }
      ]
    },
    {
      "id": 73,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "國學常識",
            "toTeacher": "無",
            "toSchool": "老師教得很好"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "文法",
            "toTeacher": "無",
            "toSchool": "老師教得很好"
          }
        },
        {
          "subject": "數學",
          "teacher": "蘇試",
          "group": "A+(教師：蘇試)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "幾何圖形",
            "toTeacher": "無",
            "toSchool": "老師教得很好"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "歷史常識",
            "toTeacher": "無",
            "toSchool": "老師教得很好"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地理常識",
            "toTeacher": "無",
            "toSchool": "老師教得很好"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "公民常識",
            "toTeacher": "無",
            "toSchool": "老師教得很好"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "理化常識",
            "toTeacher": "無",
            "toSchool": "老師教得很好"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "電腦常識",
            "toTeacher": "無",
            "toSchool": "老師教得很好"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文文法",
            "toTeacher": "無",
            "toSchool": "老師教得很好"
          }
        }
      ]
    },
    {
      "id": 74,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "對自己國文有更加認知",
            "toTeacher": "謝謝老師",
            "toSchool": "建議全校都給玉華老師教"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A3(教師：羅雅苓)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文 有十位數了",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "吳宇綸",
          "group": "A(教師：吳宇綸)",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "不同意",
            "7": "同意",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "學會數學",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學會歷史",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學會地理",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "當良好公民",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學會理化",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學會電腦",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "B(Gina)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文聽得懂一些了",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 75,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "如何更有效率複習國文",
            "toTeacher": "謝謝老師",
            "toSchool": "這個老師很認真"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文更好了",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "我很喜歡英文課"
          }
        },
        {
          "subject": "數學",
          "teacher": "蘇試",
          "group": "A+(教師：蘇試)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "能理解數學",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "歷史進步",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地理變好",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "公民能理解",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "理化能了解",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "電腦變好",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "更勇於開口說英文",
            "toTeacher": "Thank you teacher for your teaching",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 77,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "增加了我的國文程度",
            "toTeacher": "上課很有趣",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "文法的運用",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "蘇試",
          "group": "A+(教師：蘇試)",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "聽不懂",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多歷史有關的故事",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "地理位置的了解",
            "toTeacher": "地理好背喔喔",
            "toSchool": "地理課有點少"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "有了更多對法律的理解",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "理化知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "3D打印很有趣 雷雕",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文能力的提升",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 78,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "負責任",
            "toSchool": "環境很棒"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到很多單字",
            "toTeacher": "老師很負責任 上課也很認真 我很喜歡",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "B(教師：陳昱澐)",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "不同意",
            "4": "不同意",
            "5": "不同意",
            "6": "不同意",
            "7": "不同意",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "老師很認真",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "同意",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "學了很多歷史知識",
            "toTeacher": "很棒",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "理解很多地理知識",
            "toTeacher": "老師負責任",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "理解公民知識",
            "toTeacher": "負責任",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "同意",
            "4": "普通",
            "5": "同意",
            "6": "普通",
            "7": "普通",
            "8": "同意",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "負責任",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "負責任",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(Roja)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "負責任",
            "toSchool": "很棒"
          }
        }
      ]
    },
    {
      "id": 79,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "老師很認真",
            "toTeacher": "老師人很好",
            "toSchool": "好累"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A3(教師：羅雅苓)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "很多知識",
            "toTeacher": "無",
            "toSchool": "累"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "B(教師：陳昱澐)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "很好玩",
            "toTeacher": "老師很棒",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "老師教學方式我很喜歡",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "老師教學方式我很喜歡",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "老師教學方式我很喜歡",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "老師教學方式我很喜歡",
            "toTeacher": "老師很好",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "老師教學方式我很喜歡",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "B(Gina)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "老師教學方式我很喜歡",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 80,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到很多課本以外的知識，像是經史子集",
            "toTeacher": "謝謝您豐富有趣教導",
            "toSchool": "很感謝有玉華老師來教導我"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "文法",
            "toTeacher": "老師人很好，細心糾正每一次的錯誤",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "蘇試",
          "group": "A+(教師：蘇試)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "數學知識",
            "toTeacher": "老始能不能教我怎麼不要討厭數學",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "歷史知識",
            "toTeacher": "歷史年份真的好難背",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "普通",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地理知識",
            "toTeacher": "好討厭漠南非洲。",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "公民知識",
            "toTeacher": "老師您講得很好，我的公民讀得很順利",
            "toSchool": "無"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "理化知識",
            "toTeacher": "老師真的講得很好但上課能不能講細一點",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "普通",
            "3": "不同意",
            "4": "普通",
            "5": "不同意",
            "6": "不同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "科技知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "esl",
            "toTeacher": "Thank you for your guidance.",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 81,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "國文能力",
            "toTeacher": "感謝你認真教導我!",
            "toSchool": "這個老師可以考慮升職加薪。"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "普通",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "英文能力",
            "toTeacher": "你的教導方式蠻幽默的!  就只是唸英文可以再加強。",
            "toSchool": "這老師不錯!!"
          }
        },
        {
          "subject": "數學",
          "teacher": "蘇試",
          "group": "A+(教師：蘇試)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "數學解決能力",
            "toTeacher": "感謝你有幫我解決我部會的東西! 就只是每次上你的課都會很吵。",
            "toSchool": "這老師不錯!"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "歷史知識",
            "toTeacher": "你真的是位認真的老師! 且上課也蠻有趣!",
            "toSchool": "這老師不錯!"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "地理知識",
            "toTeacher": "你是一個蠻幽默卻懂得管秩序的老師!",
            "toSchool": "這老師不錯!"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "公民與法律知識",
            "toTeacher": "你是一個我很喜歡的老師!",
            "toSchool": "這老師真的不錯!"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "理化知識",
            "toTeacher": "我很喜歡在課上看LIS的影片!",
            "toSchool": "這老師真的不錯!"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "科技知識",
            "toTeacher": "蠻喜歡上你的課的!",
            "toSchool": "這老師不錯!"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "英文能力",
            "toTeacher": "I like your class somehow, but I usually just find it kind of boring when we're doing works.",
            "toSchool": "這老師還okay!"
          }
        }
      ]
    },
    {
      "id": 82,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到很多文言文跟怎麼養成學習的習慣",
            "toTeacher": "謝謝老師教我讀書上的知識",
            "toSchool": "謝謝老師"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "知道怎麼讀文法",
            "toTeacher": "沒有",
            "toSchool": "謝謝老師"
          }
        },
        {
          "subject": "數學",
          "teacher": "吳宇綸",
          "group": "A(教師：吳宇綸)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "普通",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "讓我懂得怎麼用公式",
            "toTeacher": "不用管不想學的人",
            "toSchool": "謝謝老師"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "同意",
            "8": "非常同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學會歷史的奇怪知識",
            "toTeacher": "老師對我們很好",
            "toSchool": "謝謝老師"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多很細的地理知識",
            "toTeacher": "沒有",
            "toSchool": "謝謝老師"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "懂得尊重人",
            "toTeacher": "沒有",
            "toSchool": "謝謝老師"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多實驗的知識",
            "toTeacher": "很好",
            "toSchool": "謝謝老師"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "電腦的奇怪知識",
            "toTeacher": "沒有",
            "toSchool": "謝謝老師"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(Roja)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "english",
            "toTeacher": "no",
            "toSchool": "thank you teacher"
          }
        }
      ]
    },
    {
      "id": 83,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到很多",
            "toTeacher": "上課很有趣",
            "toSchool": "讚"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "課外的東西也學到很多",
            "toTeacher": "讚 謝謝撈屍",
            "toSchool": "讚"
          }
        },
        {
          "subject": "數學",
          "teacher": "蘇試",
          "group": "A+(教師：蘇試)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝",
            "toSchool": "讚"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝",
            "toSchool": "棒"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "好多",
            "toTeacher": "謝謝",
            "toSchool": "讚"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "良多",
            "toTeacher": "讚",
            "toSchool": "棒"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "讚",
            "toSchool": "棒"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "謝謝",
            "toSchool": "棒"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "非常多常多",
            "toTeacher": "good",
            "toSchool": "good"
          }
        }
      ]
    },
    {
      "id": 84,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "多了很多國文知識，老師說的話基本都會記得",
            "toTeacher": "老師的課非常有趣",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "普通",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "在單字方面多很多詞彙輛",
            "toTeacher": "我個人覺得默書沒什麼用",
            "toSchool": "視聽教室的冷氣很吵"
          }
        },
        {
          "subject": "數學",
          "teacher": "吳宇綸",
          "group": "A(教師：吳宇綸)",
          "ratings": {
            "1": "不同意",
            "2": "普通",
            "3": "不同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "學會數學",
            "toTeacher": "上課前幾分鐘8B的幾乎都沒來",
            "toSchool": "8A班導師一直點名學生，旁邊的同學就會被打擾"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "收穫歷史知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "收穫知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "收穫知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "普通",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "收穫知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "普通",
            "3": "不同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "收穫知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "收穫知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 85,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A3(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "如何背單字",
            "toTeacher": "thanks",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "吳宇綸",
          "group": "A(教師：吳宇綸)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "應用題如何猜解",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "世界氣候",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "寫題速度",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "B(Gina)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 86,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "增加語文常識",
            "toTeacher": "謝謝老師這一年來的諄諄教誨",
            "toSchool": "謝謝學校提供學習場所"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "增加英文知識",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校讓我們分駔可以給不同的老師教"
          }
        },
        {
          "subject": "數學",
          "teacher": "吳宇綸",
          "group": "A(教師：吳宇綸)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "學會數學",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校讓我們分組"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "學會歷史",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校選的書"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "學會地理",
            "toTeacher": "老師上課很有趣",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "學會一些法律",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "學會科學知識",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "學會用程式",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校提供電腦"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "學會較難文法和單字",
            "toTeacher": "Thank you for teaching us English.",
            "toSchool": "謝謝讓外師教我們"
          }
        }
      ]
    },
    {
      "id": 87,
      "className": "8A",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "國文的理解能力有增加",
            "toTeacher": "謝謝教導",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多文法的使用方法",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "蘇試",
          "group": "A+(教師：蘇試)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "幾何的計算有進步",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "超級多",
            "toTeacher": "教的很好",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地理地圖及氣候",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 88,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "讓我對國文很有信心",
            "toTeacher": "謝謝老師教我國文和背注釋",
            "toSchool": "謝謝您們請到了這位好老師"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A3(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文單字會很多",
            "toTeacher": "謝謝老師教我文法",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "B(教師：陳昱澐)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "會四邊形的算法",
            "toTeacher": "謝謝老師教我數學",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "會冷戰和六四事件",
            "toTeacher": "謝謝老師教我歷史",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "教會我宗教",
            "toTeacher": "謝謝老師教我地理",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "教會我刑法",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "教會我壓力和摩擦力",
            "toTeacher": "謝謝老師給我們看關於理化的影片",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "讓我有用雷雕",
            "toTeacher": "謝謝給我們用雷雕",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "B(Gina)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "會ㄧ些些英文",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 89,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "不同意",
            "6": "不同意",
            "7": "不同意",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "學習",
            "toTeacher": "沒有",
            "toSchool": "太多了"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A3(教師：羅雅苓)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學習",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "數學",
          "teacher": "吳宇綸",
          "group": "A(教師：吳宇綸)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "學習",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學習",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學習",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學習",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學習",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學習",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "B(Gina)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學習",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        }
      ]
    },
    {
      "id": 90,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到了許多詞語",
            "toTeacher": "謝謝老師 辛苦了",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "文法學得不錯",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "數學",
          "teacher": "蘇試",
          "group": "A+(教師：蘇試)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "練習很多題目",
            "toTeacher": "辛苦了",
            "toSchool": "謝謝學校分組"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "歷史比較了解",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "地理學得不錯",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "公民更加理解",
            "toTeacher": "謝謝老師 辛苦了",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "普通",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到了許多力的作用",
            "toTeacher": "老師講解得非常易懂 謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "學會用3D機器",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(Roja)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "英文聽力較好 口說更容易",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        }
      ]
    },
    {
      "id": 91,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "不同意",
            "6": "普通",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "形音義",
            "toTeacher": "老師教得很好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A3(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "單字",
            "toTeacher": "老師教得很好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "B(教師：陳昱澐)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "特殊的四邊形",
            "toTeacher": "老師教得好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "中國天安門事件",
            "toTeacher": "老師教得很好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "漠南非洲",
            "toTeacher": "老師教得很好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "兒少法",
            "toTeacher": "老師教得很好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "摩擦力浮力",
            "toTeacher": "老師教得很好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "三D、雷標",
            "toTeacher": "老師教得很好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "B(Gina)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "英文",
            "toTeacher": "老師教得很好",
            "toSchool": "沒有"
          }
        }
      ]
    },
    {
      "id": 92,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很詳細",
            "toTeacher": "謝謝老師",
            "toSchool": "感恩"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "單字量變多",
            "toTeacher": "謝謝老師讓我們文法進步",
            "toSchool": "湘平老師人很好"
          }
        },
        {
          "subject": "數學",
          "teacher": "吳宇綸",
          "group": "A(教師：吳宇綸)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "數學進步",
            "toTeacher": "感恩",
            "toSchool": "感恩"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "認識過去人們的收穫",
            "toTeacher": "教的豐富有趣",
            "toSchool": "瑋筠老師人很好"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地理有變好",
            "toTeacher": "上課超好玩",
            "toSchool": "教得很詳細"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "刑法學得很好",
            "toTeacher": "感恩",
            "toSchool": "老師教得很豐富"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "化學進步",
            "toTeacher": "謝謝老師",
            "toSchool": "佳玲老師人很好"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學會用軟體",
            "toTeacher": "感恩",
            "toSchool": "感恩"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學會做一個自律的人",
            "toTeacher": "很喜歡你的教學方式",
            "toSchool": "上課風格很輕鬆"
          }
        }
      ]
    },
    {
      "id": 93,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "有很多種的國文補充。如:雙文 形音義...",
            "toTeacher": "學到很多國文知識和古人詩句，謝謝老師",
            "toSchool": "課程排得好"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文文法",
            "toTeacher": "老師教的難度可以在提升一點(謝謝",
            "toSchool": "可以在難一點"
          }
        },
        {
          "subject": "數學",
          "teacher": "蘇試",
          "group": "A+(教師：蘇試)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "數學",
            "toTeacher": "老師教得很好謝謝午休一直教我不會的題目",
            "toSchool": "老師安排的剛剛好"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學的很多",
            "toTeacher": "謝謝師給我們看那麼多影片",
            "toSchool": "可以在多點課"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "世界氣候",
            "toTeacher": "老師上課很有趣",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "各種法律",
            "toTeacher": "謝謝老師教學",
            "toSchool": "無"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "各種很難的力",
            "toTeacher": "老師希望可以在教詳細一點",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "非常同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "3d列印",
            "toTeacher": "我想多學一點科技相關的",
            "toSchool": "想多學一些相關知識"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "文法學道很多",
            "toTeacher": "我很喜歡老師的課",
            "toSchool": "可以在難一點"
          }
        }
      ]
    },
    {
      "id": 94,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "國文科成績提升不少",
            "toTeacher": "謝謝老師",
            "toSchool": "國文課很有趣"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "不同意",
            "4": "普通",
            "5": "普通",
            "6": "不同意",
            "7": "非常同意",
            "8": "普通",
            "9": "普通",
            "10": "不同意"
          },
          "qa": {
            "harvest": "更了解英文文法",
            "toTeacher": "謝謝老師",
            "toSchool": "英文課有點無聊"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "B(教師：陳昱澐)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我會想認真學習",
            "toTeacher": "謝謝老師",
            "toSchool": "數學很好玩"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "讓我覺得歷史課很好玩",
            "toTeacher": "謝謝老師",
            "toSchool": "歷史課很有趣"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地理課是真的很好玩",
            "toTeacher": "謝謝老師",
            "toSchool": "地理課是真的很有趣"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "更了解基本公民課知識",
            "toTeacher": "謝謝老師",
            "toSchool": "老師講的很詳細"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "普通",
            "4": "普通",
            "5": "不同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到很多理化知識",
            "toTeacher": "謝謝老師",
            "toSchool": "理化好難"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "更會用遊戲程式",
            "toTeacher": "謝謝老師",
            "toSchool": "很好玩"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "更越來越敢開口",
            "toTeacher": "謝謝老師",
            "toSchool": "很棒"
          }
        }
      ]
    },
    {
      "id": 95,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我學到很國文知識",
            "toTeacher": "謝謝您的耐心教導",
            "toSchool": "國文課程內容常豐富"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "文法很快就理解了",
            "toTeacher": "謝謝您總是給我們文法講義跟練習卷讓我文法進步很多",
            "toSchool": "上了英文課後有明顯進步"
          }
        },
        {
          "subject": "數學",
          "teacher": "蘇試",
          "group": "A+(教師：蘇試)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到了數學的難題",
            "toTeacher": "連續的考試讓我不僅訓練了算數速度也更容易解題了",
            "toSchool": "數學課程內容常有趣"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "更熟知歷史發展",
            "toTeacher": "每次的課程都讓我很快就理解了",
            "toSchool": "歷史課程內容常有趣"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到了各國的各種知識",
            "toTeacher": "課堂非常有趣",
            "toSchool": "地理能學到許多知識"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "更了解社會",
            "toTeacher": "課程非常詳細",
            "toSchool": "公民課程內容非常豐富"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "能學到許多科學知識",
            "toTeacher": "講解非常易懂",
            "toSchool": "理化課程非常有趣"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "能學到電腦知識",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校有資訊課"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "B(Gina)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "英文進步",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校有ESL課"
          }
        }
      ]
    },
    {
      "id": 96,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "四大奇書、古文、文言文上更加理解",
            "toTeacher": "我筆記都有做，上課也很認真聽，但是大卷一直是我的囹圄",
            "toSchool": "老師教得很好、每個問題都會仔細回答、很快就能理解"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "小學到國中甚至高中的內容都有吸收到(包括課程以外知識)",
            "toTeacher": "內容很詳盡、但有些問了還是比較不能理解",
            "toSchool": "是我看過教書效率最高，內容最詳盡的老師"
          }
        },
        {
          "subject": "數學",
          "teacher": "蘇試",
          "group": "A+(教師：蘇試)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "提升我的數感，而且老師都很細心把每題不會的交懂",
            "toTeacher": "謝謝老師不管上課，下課，午休都會把我們的數學教到會為止",
            "toSchool": "老師人非常好，會給我額外的考卷，並把我不會的題目都交懂"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "許多重點都能在老師教學中掌握(包括會考重點)",
            "toTeacher": "老師很盡責把許多課程和額外的考題都給我們做額外的練習",
            "toSchool": "上課內容很風趣，常把自身經驗加入教學中，方便理解"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "對於重點(地形，氣候，宗教)有更深入的理解",
            "toTeacher": "地理是我社會科最弱的可是每次讀了考試總出現一些篇課外和常識的這個我比較弱",
            "toSchool": "上課時常能讓我保持專注，在教學的同時加入一些幽默與風趣"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "民法，刑法，行政法的內容和執行方式有很大的收穫",
            "toTeacher": "有時候觀念混再一起我比較不容易理解",
            "toSchool": "這一科是我社會科裡最好掌握的 但對於綜合型素養考題希望有多一些練習"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "力學和化合物的觀念有加深 且化合物對我來說較易理解",
            "toTeacher": "第六章(力)對我來說比較難 而且理解上也有點困難 並且基礎觀念上有些缺乏",
            "toSchool": "第六章會考一定會出 但我這個單元比較不好 考試錯一兩題 對的題目也很吃力"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "3D技術的運用有根深的掌握",
            "toTeacher": "感謝老師細心的教導 有任何問題也都會及時幫助",
            "toSchool": "科技課很放鬆 同時也學到很多關於科技與程式(AI, Scratch)的運用"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "掌握一些單字和基礎文法",
            "toTeacher": "每次上課都很開心而且英文溝通上也都很好",
            "toSchool": "老師上課很認真 但希望多一些生活類型 在國外會用到的單字和文法"
          }
        }
      ]
    },
    {
      "id": 97,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "不同意",
            "4": "不同意",
            "5": "不同意",
            "6": "不同意",
            "7": "不同意",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A3(教師：羅雅苓)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "數學",
          "teacher": "吳宇綸",
          "group": "A(教師：吳宇綸)",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "不同意",
            "4": "不同意",
            "5": "不同意",
            "6": "不同意",
            "7": "不同意",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "不要",
            "toTeacher": "不要",
            "toSchool": "沒"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "老師善良",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "繼續保持",
            "toSchool": "沒"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "沒",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很好",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "B(Gina)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多英文",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        }
      ]
    },
    {
      "id": 98,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常同意",
            "3": "非常不同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "非常不同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "B(教師：陳昱澐)",
          "ratings": {
            "1": "非常不同意",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "數學",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "非常不同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "no",
            "toTeacher": "no",
            "toSchool": "no"
          }
        }
      ]
    },
    {
      "id": 99,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "不同意",
            "3": "不同意",
            "4": "不同意",
            "5": "不同意",
            "6": "不同意",
            "7": "不同意",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "罰抄太多",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "英文",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "數學",
          "teacher": "吳宇綸",
          "group": "A(教師：吳宇綸)",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "x",
            "toTeacher": "笑一個一個",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "中國歷史",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到很多關於天氣的知識",
            "toTeacher": "handsome",
            "toSchool": "可以當我們班導導"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "刑法",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "理化相關知識",
            "toTeacher": "想做實驗",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學會寫程式 寫代碼",
            "toTeacher": "老好帥",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(Roja)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "英文 報告",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        }
      ]
    },
    {
      "id": 101,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "國字學到更多",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到更多英文",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "數學",
          "teacher": "吳宇綸",
          "group": "A(教師：吳宇綸)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到數學",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到歷史",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到地理",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到公民",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到理化",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到電腦",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(Roja)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到ESL",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝"
          }
        }
      ]
    },
    {
      "id": 102,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "形音義訂正五遍義訂正五遍",
            "toTeacher": "不要擺臭臉",
            "toSchool": "形音義要背的範圍太多了"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "不同意",
            "7": "不同意",
            "8": "不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "跟定考無關的一堆單字補充",
            "toTeacher": "單字不用補充那麼多 要求成績太高",
            "toSchool": "希望可以換老師"
          }
        },
        {
          "subject": "數學",
          "teacher": "吳宇綸",
          "group": "A(教師：吳宇綸)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "不同意",
            "4": "同意",
            "5": "同意",
            "6": "不同意",
            "7": "普通",
            "8": "不同意",
            "9": "普通",
            "10": "不同意"
          },
          "qa": {
            "harvest": "prime",
            "toTeacher": "課程太無趣",
            "toSchool": "課程可以有趣一點"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "漢武帝",
            "toTeacher": "上課很有趣",
            "toSchool": "上課很有趣"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "上課很有趣",
            "toTeacher": "上課很有趣",
            "toSchool": "上課很有趣"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "不同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "吳",
            "toTeacher": "無",
            "toSchool": "吳"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "scratch",
            "toTeacher": "chat gpt",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(Roja)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "吳",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 103,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "增加了知識",
            "toTeacher": "謝謝老師 你好棒",
            "toSchool": "謝謝學校 你們好棒"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學了好多英文",
            "toTeacher": "謝謝老師 你好棒",
            "toSchool": "謝謝學校 給我們們的資源"
          }
        },
        {
          "subject": "數學",
          "teacher": "吳宇綸",
          "group": "A(教師：吳宇綸)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "增加好多數學知識",
            "toTeacher": "謝謝老師 你好棒",
            "toSchool": "謝謝學校 讓我們數學分組"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "增加了很多歷史知識",
            "toTeacher": "謝謝老師 你好棒",
            "toSchool": "謝謝學校給我們的資源"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "增加了地理知識",
            "toTeacher": "謝謝老師 你好棒",
            "toSchool": "謝謝學校給我們的資源"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "老師很用心",
            "toTeacher": "謝謝老師 你好棒",
            "toSchool": "謝謝學校請了個好老師"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "都好難 我努力了 老師期末拜託下我級格",
            "toTeacher": "謝謝老師 你好棒 老師期末拜託下我級格",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "好多資訊知識",
            "toTeacher": "謝謝老師 你好棒",
            "toSchool": "謝謝學校嚷我們有有趣的資訊課"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多英文知識",
            "toTeacher": "謝謝老師 你好棒",
            "toSchool": "謝謝學校請了個好老師"
          }
        }
      ]
    },
    {
      "id": 104,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "老師教的很用心",
            "toTeacher": "謝謝老師，你辛苦了",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "考試很多",
            "toTeacher": "謝謝老師",
            "toSchool": "老師很棒"
          }
        },
        {
          "subject": "數學",
          "teacher": "吳宇綸",
          "group": "A(教師：吳宇綸)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學會如何靈活的運用算式",
            "toTeacher": "老師你很棒，雖然上課的時候有些同學會聊天",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "了解以前的歷史",
            "toTeacher": "謝謝老師",
            "toSchool": "老師很認真"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學會各國的地理位置",
            "toTeacher": "謝謝老師，你真棒",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學會各種法律",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學會了一些日常生活中長見的力",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學會關於scrach的製作方式",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(Roja)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學會日常生活中不容易用到的英文單字",
            "toTeacher": "Thanks teacher",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 105,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到很多",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A3(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多知識",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "數學",
          "teacher": "吳宇綸",
          "group": "A(教師：吳宇綸)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到更多公式",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我對歷史更有興趣",
            "toTeacher": "謝謝老師我學的很開心",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "許多知識",
            "toTeacher": "謝謝老師我學的很開心",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "與生活息息相關的事物",
            "toTeacher": "謝謝老師我學的很開心",
            "toSchool": "無"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "我學到很多有趣的知識",
            "toTeacher": "謝謝老師我學的很開心",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "電腦應用",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(Roja)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "英文進步",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 106,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "我學到了許多我原本不會的字",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A3(教師：羅雅苓)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "我學到了許多英文單字",
            "toTeacher": "沒有",
            "toSchool": "希望可以一直跟著Dona老師學習英文"
          }
        },
        {
          "subject": "數學",
          "teacher": "蘇試",
          "group": "A+(教師：蘇試)",
          "ratings": {
            "1": "非常同意",
            "2": "普通",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學會一些數學公式",
            "toTeacher": "謝謝老師額外給我數學考卷",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "我學到了許多中國大陸和台灣的歷史",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "我學到了許多地理位置",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "我學到了兒少法刑法民法",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "我學到了氧化還原",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "我學到了程式設計",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(Roja)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "我學到了許多單字和文法",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        }
      ]
    },
    {
      "id": 107,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "不同意",
            "7": "同意",
            "8": "不同意",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "普通",
            "8": "不同意",
            "9": "不同意",
            "10": "不同意"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A(Gina)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "謝謝老師",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 108,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "在上文言文的時候學到了很多東西，有些古代的用詞與現代不同，所以我從中得到了新知識。",
            "toTeacher": "感謝老師上課認真教導，儘管同學們的成績不是很理想，仍未放棄。",
            "toSchool": "謝謝學校給予學生良好的教師資源"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "文法及寫作能力加強",
            "toTeacher": "感謝老師上課認真教導，儘管同學們的成績不是很理想，仍未放棄。",
            "toSchool": "謝謝學校給予學生良好的教師資源"
          }
        },
        {
          "subject": "數學",
          "teacher": "李牧",
          "group": "A(教師：李牧)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到了如何以較快速與便捷的方式解題",
            "toTeacher": "感謝老師上課認真教導，儘管同學們的成績不是很理想，仍未放棄。",
            "toSchool": "謝謝學校給予學生良好的教師資源"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "從老師身上學到了很多課本外的內容",
            "toTeacher": "感謝老師上課認真教導，即向我們分享各種個人經歷",
            "toSchool": "謝謝學校提供學生資深的教師資源"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到了很多課本外的知識",
            "toTeacher": "謝謝老師提供融洽的學習氛圍",
            "toSchool": "謝謝學校提供良好的教師資源"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "從老師身上學到了很多課本外的內容",
            "toTeacher": "感謝老師上課認真教導，即向我們分享各種個人經歷",
            "toSchool": "謝謝學校提供學生資深的教師資源"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到了很多快速的解題方式，觀念也清晰許多",
            "toTeacher": "感謝老師上課認真教導，儘管同學們的成績不是很理想",
            "toSchool": "謝謝學校提供學生資深的教師資源"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到了很多快速的解題方式，觀念也清晰許多",
            "toTeacher": "感謝老師上課認真教導，儘管同學們的成績不是很理想",
            "toSchool": "謝謝學校提供學生資深的教師資源"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "普通",
            "3": "不同意",
            "4": "普通",
            "5": "普通",
            "6": "不同意",
            "7": "普通",
            "8": "普通",
            "9": "非常同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "如何寫程式代碼",
            "toTeacher": "感謝老師上課認真教導",
            "toSchool": "謝謝學校提供學生資深的教師資源"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(教師：Chad)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "不只英文進步，也從老師身上學到很多關於人生的重要道理",
            "toTeacher": "感謝老師上課認真教導",
            "toSchool": "謝謝學校提供學生資深的教師資源"
          }
        }
      ]
    },
    {
      "id": 109,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我提升了閱讀理解與寫作能力，也學會從不同角度思考問題",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我增進了英文閱讀、聽力與寫作能力",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "不同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我提升了解題能力與數學思考能力",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我更了解不同時代的發展脈絡，也培養了從多元角度思考歷史事件的能力",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我更了解人文與自然環境之間的關係",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我更了解社會運作與公民責任",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "無"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我了解物質變化的原理",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "無"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我更了解地球環境與自然現象的形成原因",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我認識了 AI 人工智慧的應用與發展",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(教師：Chad)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我提升了使用英語溝通的自信心",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 110,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "漸漸能找到自己讀國文的方式",
            "toTeacher": "謝謝老師的耐心每次都很溫柔幫我們班上課辛苦了",
            "toSchool": "謝謝學校安排這麼勵志的老師"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A2(教師：羅雅苓)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "非常同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "背單字的重要",
            "toTeacher": "謝謝老師跟我們分享了很多生活小事來運用在英文上",
            "toSchool": "謝謝學校安排這麼溫柔的老師"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "每天都要算數學而不是只有在課堂上認真",
            "toTeacher": "謝謝老師每次上課都很賣力的教導就所們聽不懂你也是很耐心的在教一次",
            "toSchool": "謝謝學校安排這麼認真的老師"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學習到我們現在的生活是多麼好命",
            "toTeacher": "謝謝老師總是用說故事的方式來幫助我們鞋歷史讓我們能簡單學習申奧德歷史",
            "toSchool": "謝謝學校安排經歷這麼多的老師來教導班"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "學到產物如何與市場分配",
            "toTeacher": "謝謝老師在課堂上與我們開玩笑使分為不沉重",
            "toSchool": "謝謝學˙校安排這麼幽默的老師"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "同意",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習到財產分配",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "金屬見",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "謝謝學校安排這位老師"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "地球科學的知識",
            "toTeacher": "謝謝老師很認真的回答上課我們聽不懂的問題",
            "toSchool": "謝謝學校安排這位老師"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "ai換臉程式",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "謝謝學校安排這位老師"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Sandra",
          "group": "B(教師：Sandra)",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "關於各種情緒得英文單字",
            "toTeacher": "謝謝老師與我們般相處融洽能因材施教的教導我們班",
            "toSchool": "謝謝學校安排這位老師"
          }
        }
      ]
    },
    {
      "id": 111,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習到了很多國文知識",
            "toTeacher": "謝謝老師",
            "toSchool": "國文可以下午嗎"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A2(教師：羅雅苓)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文能力變好了",
            "toTeacher": "謝謝老師 你好棒",
            "toSchool": "下學期可以也是Dona老師嗎"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "算數能力變了",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "許多歷史知識",
            "toTeacher": "謝謝老師",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多地理故事",
            "toTeacher": "謝謝老師",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "成為一個好公民",
            "toTeacher": "謝謝老師",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "對化學有更多的了解",
            "toTeacher": "謝謝老師",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地科的很多知識",
            "toTeacher": "謝謝老師",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "電腦的應用",
            "toTeacher": "謝謝老師",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Sandra",
          "group": "B(教師：Sandra)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文能力變好了",
            "toTeacher": "謝謝老師 我愛你喔",
            "toSchool": "沒有"
          }
        }
      ]
    },
    {
      "id": 112,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "能背出琵琶行了",
            "toTeacher": "謝謝老師 我國文進步很多",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A2(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到很多新的東西",
            "toTeacher": "謝謝老師 我英文進步很多",
            "toSchool": "覺得學校英文分組模式很好 能照自己的程度學習"
          }
        },
        {
          "subject": "數學",
          "teacher": "李牧",
          "group": "A(教師：李牧)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "在學校學到補習班才有的東西",
            "toTeacher": "謝謝老師 我數學進步很多",
            "toSchool": "數學分組模式很好 能照自己程度學習"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "普通",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "歷史進步很多",
            "toTeacher": "謝謝老師 我歷史進步很多",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地理進步很多",
            "toTeacher": "謝謝老師 我地理進步很多",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "普通",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "公民進步很多",
            "toTeacher": "謝謝老師 我公民進步很多",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "化學進步很多",
            "toTeacher": "老師 我化學進步很多",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地球科學進步很多",
            "toTeacher": "老師 我地球科學 進步很多",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "進步很多",
            "toTeacher": "老師",
            "toSchool": "謝謝"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(教師：Roja)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "進步很多",
            "toTeacher": "謝謝老師 我英文進步很多",
            "toSchool": "分組上課方法很棒"
          }
        }
      ]
    },
    {
      "id": 113,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "國文素養進步",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝你聘請那麼優秀的老師"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A2(教師：羅雅苓)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "普通",
            "7": "普通",
            "8": "同意",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "文法提升",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝你聘請那麼優秀的老師"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "數學提升",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝你聘請那麼優秀的老師"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "歷史提升",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝你聘請那麼優秀的老師"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "地理提升",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝你聘請那麼優秀的老師"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "公民提升",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝你聘請那麼優秀的老師"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "化學提升",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝你聘請那麼優秀的老師"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地科提升",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝你聘請那麼優秀的老師"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "科技提升",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝你聘請那麼優秀的老師"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(教師：Roja)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "英文提升",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝你聘請那麼優秀的老師"
          }
        }
      ]
    },
    {
      "id": 114,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "國文基本素養",
            "toTeacher": "當老師不容易，謝謝您",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "英文進階文法",
            "toTeacher": "您是很認真的老師，但可以慢點",
            "toSchool": "從公立國中進到雙語私立高中，英文負擔真的蠻重的"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "普通",
            "4": "同意",
            "5": "普通",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "數學知識",
            "toTeacher": "謝謝您很認真的做所有事，但希望您能適時減輕自己的壓力",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "歷史素養與知識",
            "toTeacher": "謝謝您對學生們的溫柔",
            "toSchool": "雖然這也沒辦法，但我真的覺得現在的歷史課本編的很亂 而且沒甚麼學習邏輯在"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "地理課本的內容",
            "toTeacher": "謝謝您",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "法律涵養及基本觀念",
            "toTeacher": "謝謝您以溫柔對待學生",
            "toSchool": "無"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "化學基本及補充觀念",
            "toTeacher": "老師您很認真，但我有時候真的通不懂您在講什麼，也看不懂您的板書",
            "toSchool": "化學老師需要大聲一點的麥克風"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "地科觀念",
            "toTeacher": "老師您人太好了，可以兇點",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "普通",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "ai使用及資訊城式製作",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(教師：Roja)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "英文口語練習",
            "toTeacher": "老師很認真，但有時我不知道怎麼跟他溝通，這是我個人的問題",
            "toSchool": "esl這門課很好，但像我口語能力很差，聽力也很差，聽不懂外師在講甚麼"
          }
        }
      ]
    },
    {
      "id": 115,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學習國寫寫作技巧以及文言文的解讀",
            "toTeacher": "謝謝老師很有耐心的教我們寫作的各種技巧",
            "toSchool": "升高中的一年內收穫了很多"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "普通",
            "4": "同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習到記英文單字的方法",
            "toTeacher": "謝謝老師很有耐心的教我們，也幫助我們提升成績",
            "toSchool": "升高中的一年內收穫了很多"
          }
        },
        {
          "subject": "數學",
          "teacher": "李牧",
          "group": "A(教師：李牧)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學習將題目轉化成幾何的方式",
            "toTeacher": "謝謝老師不僅在課堂上為我們解惑，還提供我們練習的作業",
            "toSchool": "升高中的一年內收穫了很多"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學習到許多課本沒寫的補充知識",
            "toTeacher": "謝謝老師每次都會找合適的資源幫我們學習",
            "toSchool": "升高中的一年內收穫了很多"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學習到各種地形",
            "toTeacher": "謝謝老師",
            "toSchool": "升高中的一年內收穫了很多"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "更清楚學習到法律相關的知識",
            "toTeacher": "謝謝老師每次都會找合適的資源幫我們學習",
            "toSchool": "升高中的一年內收穫了很多"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "普通",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "普通",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學習如何更有效率的學習",
            "toTeacher": "謝謝老師上課時都會為我們整理好重點筆記",
            "toSchool": "升高中的一年內收穫了很多"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "普通",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "理解各種現象發生的原因",
            "toTeacher": "謝謝老師每次都很用心地以畫圖的方式呈現知識",
            "toSchool": "升高中的一年內收穫了很多"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "不同意",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學習如何使用ai",
            "toTeacher": "謝謝老師",
            "toSchool": "升高中的一年內收穫了很多"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(教師：Chad)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "練習英文溝通技巧，包含口說和寫作",
            "toTeacher": "謝謝老師教我們英文寫作的格式，以及寫作的技巧",
            "toSchool": "升高中的一年內收穫了很多"
          }
        }
      ]
    },
    {
      "id": 116,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "升上高中後，國文課本中的內容幾乎都為文言文，但有國文老師帶領我們一起閱讀、翻譯為白話文，讓國文變得更有趣。",
            "toTeacher": "謝謝老師每次上課都如此認真，雖然我的考試成績並不起眼，但我很喜歡在課堂上學習您上的課。",
            "toSchool": "謝謝學校提供這麼好的學習資源，老師很認真的教導每一位同學。"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "原本對文法不熟悉的我，有了湘萍老師的教導，讓我更了解念文法的方式。",
            "toTeacher": "老師謝謝你每次都很認真地補充各種內容，讓我的英文程度有所成長。",
            "toSchool": "湘平老師每次上課都會準備很多題外的英文知識讓我們更好吸收，謝謝學校請湘平老師來教導我們。"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "在課堂中我變得更勇於開口回答問題，讓原本不喜歡數學的我，在上課的時候也能提起興趣。",
            "toTeacher": "謝謝老師每次都很認真地教導我們每一個人，就算是成績不好，也不曾放棄我們每一個人。",
            "toSchool": "美芝老師總是會用有趣的上課方式讓我們學習。"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "讓我更了解各國歷史。",
            "toTeacher": "謝謝老師的教導。",
            "toSchool": "瑋筠老師很認真的教導我們。"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我更了解各國地理。",
            "toTeacher": "謝謝老師的教導。",
            "toSchool": "文達老師很認真的教導我們。"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我更了解各公民。",
            "toTeacher": "謝謝老師的教導。",
            "toSchool": "瑋筠老師很認真的教導我們。"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "雖然我的理科不是很好，但老的教導方式讓我可以很好的進入狀態。",
            "toTeacher": "謝謝老師很認真地把知識都傳授給我們。",
            "toSchool": "志元老師很認真的教導我們。"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "讓我更了解各地科。",
            "toTeacher": "謝謝老師很認真地把知識都傳授給我們。",
            "toSchool": "謝謝老師很認真地把知識都傳授給我們。"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "讓我更了解科技。",
            "toTeacher": "謝謝老師很認真地把知識都傳授給我們。",
            "toSchool": "謝謝老師很認真地把知識都傳授給我們。"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(教師：Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "讓我更活用英文。",
            "toTeacher": "謝謝老師很認真地教導我們。",
            "toSchool": "謝謝老師很認真地把知識都傳授給我們。"
          }
        }
      ]
    },
    {
      "id": 117,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "很好的技巧",
            "toTeacher": "老師你辛苦了",
            "toSchool": "老師教得很好"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A2(教師：羅雅苓)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "有用的知識",
            "toTeacher": "老師你辛苦了",
            "toSchool": "老師教得很好"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "很好的計算過程",
            "toTeacher": "老師你辛苦了",
            "toSchool": "老師教得很好"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "有用的知識",
            "toTeacher": "老師你辛苦了",
            "toSchool": "老師教得很好"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "有用的知識",
            "toTeacher": "老師你辛苦了",
            "toSchool": "老師教得很好"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "有用的知識",
            "toTeacher": "老師你辛苦了",
            "toSchool": "老師教得很好"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "有用的知識",
            "toTeacher": "老師你辛苦了",
            "toSchool": "老師教得很好"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "有用的知識",
            "toTeacher": "老師你辛苦了",
            "toSchool": "老師教得很好"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "AI的運用",
            "toTeacher": "老師你辛苦了",
            "toSchool": "老師教得很好"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Sandra",
          "group": "B(教師：Sandra)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "有趣的課本內容",
            "toTeacher": "老師你辛苦了",
            "toSchool": "老師教得很好"
          }
        }
      ]
    },
    {
      "id": 118,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到很多比較有品質的日常用語",
            "toTeacher": "學到很多歷史知識",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到很多單字",
            "toTeacher": "作文能力變強",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "更有生活邏輯",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到我們的祖先的生活環境",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學到世界的運作",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "成為更好的公民",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "有學到基本化學",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "世界的運作",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到如何有效運用電腦",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(教師：Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "更大方，更勇於展現自我",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        }
      ]
    },
    {
      "id": 119,
      "className": "高二(文組)",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我對國文越有自信",
            "toTeacher": "老師 謝謝",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "英文作文更強",
            "toTeacher": "英文很棒",
            "toSchool": "吳"
          }
        },
        {
          "subject": "數學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "讓我對數學有自信",
            "toTeacher": "教得很好",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "探索歷史的有趣",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "理解地理的奧妙",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "雷雕機很有趣",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "更深的文",
            "toTeacher": "thank you",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 120,
      "className": "高二(文組)",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "能充分的理解課程內容",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "能充分的理解課程內容",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "數學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "能充分的理解課程內容",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "能充分的理解課程內容",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "能充分的理解課程內容",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "能充分的理解課程內容",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "能充分的理解課程內容",
            "toTeacher": "辛苦了",
            "toSchool": "辛苦了"
          }
        }
      ]
    },
    {
      "id": 121,
      "className": "高二(文組)",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習到了各種不同的古文和文體",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "認識了不同的文法和單字",
            "toTeacher": "希望單字可以上的慢一點",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "數學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "知道了不同的數學公式和算法",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "了解了古代的戰爭和不同殖民統治的制度",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "了解了不同地圖的用法，和認識了世界各地的地形",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "了解了雷射雕刻和D列印技術",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習到了很多生難的單字，和外國的文章作品",
            "toTeacher": "沒有",
            "toSchool": "沒有"
          }
        }
      ]
    },
    {
      "id": 122,
      "className": "高二(文組)",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "非常好，收穫滿滿。",
            "toTeacher": "感謝老師。",
            "toSchool": "優秀"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "收穫了英文自主學習能力",
            "toTeacher": "培养了英文自主学习能力",
            "toSchool": "學校的分組機制特別優秀"
          }
        },
        {
          "subject": "數學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "收穫了滿滿的數學知識，也讓我愛上了數學",
            "toTeacher": "老師，您教得太好了",
            "toSchool": "感謝學校把我分到這個組"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "歷史學習報告",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "複習學測知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習3d打印和鐳雕",
            "toTeacher": "非常有趣",
            "toSchool": "感謝學校提供的資源"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A(Gina)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "練習了英文口語",
            "toTeacher": "感謝老師的悉心指導",
            "toSchool": "感謝開展esl課程"
          }
        }
      ]
    },
    {
      "id": 123,
      "className": "高二(文組)",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "閱讀能力變好",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "文法能力變好",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "知曉該如何運用公式",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "更了解歷史",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "對地理更加了解",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "了解了3D列印",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A(Gina)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "英文聽力變好",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 124,
      "className": "高二(文組)",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "普通",
            "4": "非常同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "重複複習忘記的東西，並且學新的知識",
            "toTeacher": "我會繼續努力",
            "toSchool": "我覺得很適度"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "同意",
            "2": "普通",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學了很多單字 文法",
            "toTeacher": "文法很詳細",
            "toSchool": "都很適度"
          }
        },
        {
          "subject": "數學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "數學冷知識",
            "toTeacher": "教的很認真",
            "toSchool": "非常適度"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "生活上的一些歷史",
            "toTeacher": "我覺得非常有趣",
            "toSchool": "非常適度"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "深入的地理知識",
            "toTeacher": "講話風趣 讓我們容易記住知識",
            "toSchool": "非常適度"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "學會電腦運用 和科技相關的東西",
            "toTeacher": "很有趣",
            "toSchool": "非常適度"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A(Gina)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "生活上的英文",
            "toTeacher": "謝謝老師辛苦幫助們的成果發表",
            "toSchool": "適度"
          }
        }
      ]
    },
    {
      "id": 125,
      "className": "高二(文組)",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "國文知識加深加廣",
            "toTeacher": "老師上課講的很多也會額外補充我覺得很好能讓我們知道更多",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "普通",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "雖然還是沒有很好 但能力有稍微提升一些",
            "toTeacher": "老師的教學方式很容易懂不會讓人有太大的壓力",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "讓我不再那麼討厭數學",
            "toTeacher": "老師上課態度認真負責偶爾看我們沒精神還會幹話兩句 ：）",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "複習了很多以前不太會的東西",
            "toTeacher": "老師教學方式不會太死板無聊",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "有效複習到以前的內容",
            "toTeacher": "老師會盡量用我們聽得懂的話來教學不會讓我們覺得太無聊",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "普通"
          },
          "qa": {
            "harvest": "讓我的學習歷程東西變多了",
            "toTeacher": "老師不會講解的太負責都是能負荷的範圍",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A(Gina)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "普通",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "更加的想學好英文去溝通",
            "toTeacher": "老師教學認真負責互動感也很好",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 126,
      "className": "高二(文組)",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "老師認真負責",
            "toTeacher": "感謝老師的指導",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "背了更多英文單字",
            "toTeacher": "感謝老師的指導",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "上課輕鬆有趣同時也能學到東西",
            "toTeacher": "感謝老師的指導",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "對探究與實作更理解",
            "toTeacher": "感謝老師的指導",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "對學測地理更理解",
            "toTeacher": "感謝老師的指導",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "更理解AI",
            "toTeacher": "感謝老師的指導",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "上課輕鬆有趣老師也很好笑",
            "toTeacher": "感謝老師的指導",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 127,
      "className": "高二(文組)",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "耐心 細心",
            "toTeacher": "老師謝謝你 辛苦了",
            "toSchool": "謝謝學校給我這個資源"
          }
        },
        {
          "subject": "英文",
          "teacher": "莊旭惠",
          "group": "A2(教師：莊旭惠)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學會了更多的單字",
            "toTeacher": "老師謝謝你 辛苦了",
            "toSchool": "謝謝學校給我這個資源"
          }
        },
        {
          "subject": "數學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學會多解題方式",
            "toTeacher": "老師謝謝你 你辛苦了",
            "toSchool": "謝謝學校給我這個資源"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "帶我們複習以前教過的東西，以及製作報告",
            "toTeacher": "老師謝謝你 你辛苦了",
            "toSchool": "謝謝學校給我這個資源"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "對於地形和氣象更熟悉",
            "toTeacher": "老師謝謝你 你辛苦了",
            "toSchool": "謝謝學校給我這個資源"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "製作鐳雕",
            "toTeacher": "老師謝謝你 你辛苦了",
            "toSchool": "謝謝學校給我這個資源"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "A(Gina)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到了更多課外的英文單字以及練習聽力",
            "toTeacher": "Thank you teacher for your hard work.",
            "toSchool": "謝謝學校給我這個資源"
          }
        }
      ]
    },
    {
      "id": 130,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "教得很好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A3(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "現在進行式",
            "toTeacher": "教得很好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "數學",
          "teacher": "陳昱澐",
          "group": "B(教師：陳昱澐)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "教得很好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "教得很好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "教得很好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "教得很好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "教得很好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "教得很好",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Gina",
          "group": "B(Gina)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒有",
            "toTeacher": "教得很好",
            "toSchool": "沒有"
          }
        }
      ]
    },
    {
      "id": 131,
      "className": "8B",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到國文知識",
            "toTeacher": "希望可以改掉背注釋 背這麼多沒有意義 知道意思就好 所以改成選擇題較為合適 選項多也無妨",
            "toSchool": "."
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "普通",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "會考英文的知識",
            "toTeacher": "進度太快",
            "toSchool": "."
          }
        },
        {
          "subject": "數學",
          "teacher": "吳宇綸",
          "group": "A(教師：吳宇綸)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "數學知識",
            "toTeacher": ".",
            "toSchool": "."
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "歷史知識",
            "toTeacher": ".",
            "toSchool": "."
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地理知識",
            "toTeacher": "進度稍慢",
            "toSchool": "."
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "公民知識",
            "toTeacher": "祝您在新學校順利",
            "toSchool": "."
          }
        },
        {
          "subject": "理化",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "理化知識",
            "toTeacher": ".",
            "toSchool": "."
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "科技知識",
            "toTeacher": ".",
            "toSchool": "."
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文知識",
            "toTeacher": ".",
            "toSchool": "."
          }
        }
      ]
    },
    {
      "id": 132,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "國文進步",
            "toTeacher": "讓國文進步",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A2(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文進步",
            "toTeacher": "讓英文進步",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "數學進步",
            "toTeacher": "讓數學進步",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "歷史進步",
            "toTeacher": "讓數學進步",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "地理進步",
            "toTeacher": "讓地理進步",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "讓地理進步",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "沒",
            "toTeacher": "沒",
            "toSchool": "沒"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(教師：Roja)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習到知識",
            "toTeacher": "學習到知識",
            "toSchool": "學習到知識"
          }
        }
      ]
    },
    {
      "id": 133,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "同意",
            "3": "不同意",
            "4": "普通",
            "5": "普通",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "我培養了良好閱讀習慣",
            "toTeacher": "謝謝老師",
            "toSchool": "感謝學校提良好的學習環境"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "不同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "我更懂得從文章中抓重點",
            "toTeacher": "謝謝老師的教導 讓我提昇學習效益",
            "toSchool": "感謝學校"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "我培養了每日練習的好習慣",
            "toTeacher": "謝謝老師讓我了解原來數學不需要死背",
            "toSchool": "感謝學校提供了好環境"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "同意",
            "9": "非常同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "我了解了歷史",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "普通",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "我了解了區位的重要性",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "我更懂得維護自身權益",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "同意",
            "8": "同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "我了解了化學知識",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "我了解地球與天體之間的運行方式",
            "toTeacher": "謝謝老師的教誨",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "我了解了如何使用電腦",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(教師：Chad)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "我了解了英文不只是背，更要思考",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校"
          }
        }
      ]
    },
    {
      "id": 134,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "文言文",
            "toTeacher": "謝謝老師",
            "toSchool": "good"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A2(教師：羅雅苓)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "文法",
            "toTeacher": "謝謝老師",
            "toSchool": "good"
          }
        },
        {
          "subject": "數學",
          "teacher": "李牧",
          "group": "A(教師：李牧)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "新的數學知識",
            "toTeacher": "謝謝老師",
            "toSchool": "good"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "以前的日本",
            "toTeacher": "謝謝老師",
            "toSchool": "good"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "世界",
            "toTeacher": "謝謝老師",
            "toSchool": "good"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "基本法律",
            "toTeacher": "謝謝老師",
            "toSchool": "good"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "基本化學",
            "toTeacher": "謝謝老師",
            "toSchool": "good"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "板塊",
            "toTeacher": "謝謝老師",
            "toSchool": "good"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "學會程式",
            "toTeacher": "謝謝老師",
            "toSchool": "good"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(教師：Roja)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "成發",
            "toTeacher": "謝謝老師",
            "toSchool": "good"
          }
        }
      ]
    },
    {
      "id": 135,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "教的很好",
            "toSchool": "教的很好"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A2(教師：羅雅苓)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "教的很好",
            "toSchool": "教的很好"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "教的很好",
            "toSchool": "教的很好"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "教的很好",
            "toSchool": "教的很好"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "教的很好",
            "toSchool": "教的很好"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "教的很好",
            "toSchool": "教的很好"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "教的很好",
            "toSchool": "教的很好"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "教的很好",
            "toSchool": "教的很好"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "教的很好",
            "toSchool": "教的很好"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(教師：Roja)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很多",
            "toTeacher": "教的很好",
            "toSchool": "教的很好"
          }
        }
      ]
    },
    {
      "id": 136,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "國文變好",
            "toTeacher": "你很棒",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A2(教師：羅雅苓)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "換英文老師"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "數學變好",
            "toTeacher": "很棒",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "很棒",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "很棒",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "很棒",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常不同意",
            "3": "非常不同意",
            "4": "非常不同意",
            "5": "非常不同意",
            "6": "非常不同意",
            "7": "非常不同意",
            "8": "非常不同意",
            "9": "非常不同意",
            "10": "非常不同意"
          },
          "qa": {
            "harvest": "無",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "很棒",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "很棒",
            "toSchool": "很棒"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(教師：Roja)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很棒",
            "toTeacher": "很棒",
            "toSchool": "很棒"
          }
        }
      ]
    },
    {
      "id": 137,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "普通",
            "3": "非常不同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "我學到了很多國文的知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A2(教師：羅雅苓)",
          "ratings": {
            "1": "非常不同意",
            "2": "普通",
            "3": "非常不同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "我學到了很多英文的知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "非常不同意",
            "2": "普通",
            "3": "非常不同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "我學到了很多數學的知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "普通",
            "3": "非常不同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "我學到了很多歷史的知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "普通",
            "3": "非常不同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "我學到了很多地理的知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "普通",
            "3": "非常不同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "我學到了很多公民的知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "普通",
            "3": "非常不同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "我學到了很多化學的知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "普通",
            "3": "非常不同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "我學到了很多地科的知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "普通",
            "3": "非常不同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "我學到了很多科技的知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Sandra",
          "group": "B(教師：Sandra)",
          "ratings": {
            "1": "非常不同意",
            "2": "普通",
            "3": "非常不同意",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "我學到了很多ESL的知識",
            "toTeacher": "無",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 138,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "增加了我的國文能力",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校給我良好的讀書環境"
          }
        },
        {
          "subject": "英文",
          "teacher": "羅雅苓",
          "group": "A2(教師：羅雅苓)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "英文能力增強",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校給我良好的讀書環境"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "增進碩學能力",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校給我良好的讀書環境"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "增進我歷史能力",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校給我良好的讀書環境"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "增進我地理的能力",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校給我良好的讀書環境"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "增進我公民的能力",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校給我良好的讀書環境"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "增進我化學的能力",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校給我良好的讀書環境"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "增進我地球科學的能力",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校給我良好的讀書環境"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "精進我資訊能力",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校給我良好的讀書環境"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(教師：Roja)",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "普通",
            "5": "普通",
            "6": "普通",
            "7": "普通",
            "8": "普通",
            "9": "普通",
            "10": "普通"
          },
          "qa": {
            "harvest": "增進我英文能力",
            "toTeacher": "謝謝老師",
            "toSchool": "謝謝學校給我良好的讀書環境"
          }
        }
      ]
    },
    {
      "id": 139,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很有趣",
            "toTeacher": "謝謝老師",
            "toSchool": "秀玫老師很認真的教導我們"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很有趣",
            "toTeacher": "謝謝老師",
            "toSchool": "湘平老師很認真的教導我們"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很有趣",
            "toTeacher": "謝謝老師",
            "toSchool": "美芝老師很認真的教導我們"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很有趣",
            "toTeacher": "謝謝老師",
            "toSchool": "瑋筠老師很認真的教導我們"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很有趣",
            "toTeacher": "謝謝老師",
            "toSchool": "文達老師很認真的教導我們"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很有趣",
            "toTeacher": "謝謝老師",
            "toSchool": "瑋筠老師很認真的教導我們"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很有趣",
            "toTeacher": "謝謝老師",
            "toSchool": "志元老師很認真的教導我們"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很有趣",
            "toTeacher": "謝謝老師",
            "toSchool": "玉良老師很認真的教導我們"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "同意",
            "9": "同意",
            "10": "同意"
          },
          "qa": {
            "harvest": "很有趣",
            "toTeacher": "謝謝老師",
            "toSchool": "世斌老師很認真的教導我們"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(教師：Chad)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "很有趣",
            "toTeacher": "謝謝老師",
            "toSchool": "Chad老師很認真的教導我們"
          }
        }
      ]
    },
    {
      "id": 140,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "普通",
            "7": "非常同意",
            "8": "普通",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "讓我學會了讀文言文的技巧",
            "toTeacher": "謝謝老師讓我國文有進步",
            "toSchool": "謝謝提供優良的資源讓我學習"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "讓我學到了做的結構如何書寫",
            "toTeacher": "謝謝老師願意花時間盯我的英文作文",
            "toSchool": "謝謝學校請到了一個那麼負責任的外校老師"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "這讓我學習到了如何解數學題目最快",
            "toTeacher": "謝謝老師每次都很用心地在準備課程和教我們",
            "toSchool": "謝謝學校有讓我遇到這個能盯緊我算數學的老師"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "我學到了古代的大小事",
            "toTeacher": "謝謝老師努力的上課和分享影片讓我們更深入的了解",
            "toSchool": "謝謝學校雇用了一位認真備課和上課不無聊的歷史老師"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "我學到了不只有地理還有牽涉到其他社會上的東西",
            "toTeacher": "謝謝老師那麼認真的在教我們，雖然有時會抱怨我們聽不懂",
            "toSchool": "謝謝學校邀請到了一位有趣的老師"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "我學到了很多有關社會上和法律的事物",
            "toTeacher": "謝謝老師讓我學到了很多東西",
            "toSchool": "謝謝學校讓這位老師教我們兩科"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "普通",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "普通",
            "10": "同意"
          },
          "qa": {
            "harvest": "我學到很多了之前國中沒有學到的東西",
            "toTeacher": "謝謝老師很認真地在注意我們成績還有教我們讀書的態度",
            "toSchool": "謝謝學校讓這個資歷豐富的老師教我們化學"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "我學到了很多講義上沒有的東西",
            "toTeacher": "謝謝老師即使有其他的學校或補習班要顧但依然還是花時間在我們身上",
            "toSchool": "謝謝學校讓我們遇到了這麼好的老師"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "我學到了怎麼對ai下達指令",
            "toTeacher": "謝謝老師都會準備多元的課程給我們學習",
            "toSchool": "謝謝學校有安排這個跟普通科目不同且多元的課程"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(教師：Roja)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "我學到了很多英文補充的東西以及加強之前的東西",
            "toTeacher": "謝謝老師即使語言不通但依然很想要讓我們了解他在表達甚麼",
            "toSchool": "謝謝學校有邀請到這個外師，這讓我的英文學習內容變得更加多元"
          }
        }
      ]
    },
    {
      "id": 141,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習到許多課外知識",
            "toTeacher": "謝謝老師用心指導",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "英文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習到許多課外單字",
            "toTeacher": "謝謝老師的用心監督與指導",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習到如何將數學運用在生活中",
            "toTeacher": "謝謝老師用心教導",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "聽了許多歷史故事",
            "toTeacher": "感想老師用心指導",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "認識許多地理特質",
            "toTeacher": "謝謝老師的用心指導",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習到許多法律知識",
            "toTeacher": "謝謝老師認真授課",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習了許多化學知識",
            "toTeacher": "謝謝老師用心授課",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "更認識地球",
            "toTeacher": "感謝老師的督促與指教",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習到了許多科技知識",
            "toTeacher": "謝謝老師的教導",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(教師：Roja)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習許多課外單字",
            "toTeacher": "謝謝老師認真指導",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        }
      ]
    },
    {
      "id": 142,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "利用「ORID」協助寫作文，並在老師細心教導下了解許多文句的意思",
            "toTeacher": "感謝你的用心教導，讓我們培養自然斷句的好習慣，並時常提醒我們ORID的重要",
            "toSchool": "國文課讓我受益良多"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "了解正確的讀書習慣，並且系統性的認識了許多單字與文法",
            "toTeacher": "雖然有時自己會有點應付不過來，但這樣大量的訓練都是為了我們的學習著想，謝謝您",
            "toSchool": "英文課讓我受益良多"
          }
        },
        {
          "subject": "數學",
          "teacher": "李牧",
          "group": "A(教師：李牧)",
          "ratings": {
            "1": "不同意",
            "2": "同意",
            "3": "普通",
            "4": "同意",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "普通",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "了解真正的重點為何，並在有效的學習方式及老師指導下解決問題",
            "toTeacher": "感謝您一直以來對我們的付出與努力",
            "toSchool": "數學課讓我受益良多"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "能夠清楚知道每個歷史事件的始末，並在考試過後的講解中逐漸解決問題",
            "toTeacher": "感謝您的用心教導，在我遇到困難時給予適當的協助並鼓勵我",
            "toSchool": "歷史課讓我受益良多"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "同意",
            "7": "同意",
            "8": "非常同意",
            "9": "普通",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "從適當的舉例和統整當中吸取新知識",
            "toTeacher": "感謝您的用心教導，在我遇到困難時給予適當的協助",
            "toSchool": "地理課讓我受益良多"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "能夠了解社會時事，並與課程做連結",
            "toTeacher": "感謝您的用心教導，在我遇到困難時給予適當的協助",
            "toSchool": "公民課讓我受益良多"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "普通",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "利用筆記有效抓重點去學習",
            "toTeacher": "感謝老師辛苦的指導",
            "toSchool": "化學課讓我受益良多"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "普通",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "透過歷屆試題了解相關概念",
            "toTeacher": "感謝老師辛苦的指導，並且協助我解決難題",
            "toSchool": "地科課讓我受益良多"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "普通",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "利用python 練習寫簡單的程式",
            "toTeacher": "感謝您辛苦的指導",
            "toSchool": "科技課讓我受益良多"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(教師：Chad)",
          "ratings": {
            "1": "不同意",
            "2": "同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "普通",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "練習透過思考激盪出點子，有時也能勇敢表達想法",
            "toTeacher": "感謝您辛苦的指導，讓我們逐漸提升英文與思考能力",
            "toSchool": "ESL讓我受益良多"
          }
        }
      ]
    },
    {
      "id": 143,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習許多有關於古人的東西",
            "toTeacher": "老師加油",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到很多英文",
            "toTeacher": "老師很棒",
            "toSchool": "沒有"
          }
        },
        {
          "subject": "數學",
          "teacher": "李牧",
          "group": "A(教師：李牧)",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到用不同想法解數學",
            "toTeacher": "老師真的是個天才",
            "toSchool": "無"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "能學習到比課本還要多的知識",
            "toTeacher": "老師辛苦了！",
            "toSchool": "無"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習地理知識",
            "toTeacher": "謝謝老師用心的教學",
            "toSchool": "無"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習課本外的知識",
            "toTeacher": "老師加油",
            "toSchool": "無"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習到很多化學的知識",
            "toTeacher": "謝謝老師用心的教學",
            "toSchool": "無"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習到很多地科的知識",
            "toTeacher": "謝謝老師用心的教學",
            "toSchool": "無"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習到很多電腦的知識",
            "toTeacher": "謝謝老師用心的教學",
            "toSchool": "無"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(教師：Chad)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習更深度的英文",
            "toTeacher": "謝謝老師用心的教學",
            "toSchool": "無"
          }
        }
      ]
    },
    {
      "id": 144,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到許多國學常識",
            "toTeacher": "感謝老師的督促與指教",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習許多課外單字",
            "toTeacher": "感謝老師的督促與指教",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "數學",
          "teacher": "曾美芝",
          "group": "B(教師：曾美芝)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習到如何將數學運用到生活中",
            "toTeacher": "感謝老師的督促與指教",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "認識到許多歷史故事",
            "toTeacher": "感謝老師的督促與指教",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習許多地理知識",
            "toTeacher": "感謝老師的督促與指教",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習到許多法律知識",
            "toTeacher": "感謝老師的督促與指教",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習許多化學知識",
            "toTeacher": "感謝老師的督促與指教",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "更認識地球",
            "toTeacher": "感謝老師的督促與指教",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學習如何使用電腦",
            "toTeacher": "感謝老師的督促與指教",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Roja",
          "group": "A(教師：Roja)",
          "ratings": {
            "1": "同意",
            "2": "同意",
            "3": "非常同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "學到許多新單字",
            "toTeacher": "感謝老師的督促與指教",
            "toSchool": "謝謝學校提供如此豐富的教育資源"
          }
        }
      ]
    },
    {
      "id": 145,
      "className": "高一",
      "answers": [
        {
          "subject": "國文",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "課程內容解釋詳盡，有時還會補充重要的形音義以避免犯錯",
            "toTeacher": "感謝老師的教導，參與您的國文課總讓人收穫滿滿",
            "toSchool": "國文課的內容得宜且充實"
          }
        },
        {
          "subject": "英文",
          "teacher": "鄒湘平",
          "group": "A1(教師：鄒湘平)",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "英文課程中，老師總是提供大量重要且清楚的詞彙、文法概念統整",
            "toTeacher": "感謝老師的指導，您總是幫助我們充實知識並持續進步",
            "toSchool": "英文課的內容得宜且充實"
          }
        },
        {
          "subject": "數學",
          "teacher": "李牧",
          "group": "A(教師：李牧)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "數學課程中，老師時常告訴我們考試的導向及重要概念，清楚的列出解題過程使人容易理解",
            "toTeacher": "感謝老師的指導，您總是強調重要的部分並提供練習題，逐漸讓我們明白學習的正確方法",
            "toSchool": "數學課的內容得宜且充實"
          }
        },
        {
          "subject": "歷史",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "老師時常搭配與課程相關的影片或故事，使學習過程變得有趣且更全面",
            "toTeacher": "感謝老師的指導，您總是提供許多資源開拓大家的眼界",
            "toSchool": "歷史課的內容得宜且充實"
          }
        },
        {
          "subject": "地理",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "將艱澀或容易搞混的名詞簡化，減少錯誤率",
            "toTeacher": "感謝老師的指導，您時常艱澀或容易搞混的名詞簡化，減少我們的錯誤率",
            "toSchool": "地理課的內容得宜且充實"
          }
        },
        {
          "subject": "公民",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "老師總是在需要時提供貼近生活的案例，讓學生更容易理解名詞解釋與法律內涵",
            "toTeacher": "感謝老師的指導，您總是耐心地講解容易搞混的名詞，在需要時還會提出具體事件來幫助思考",
            "toSchool": "公民課的內容得宜且充實"
          }
        },
        {
          "subject": "化學",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "老師總是強調重點與基本定義，讓我們在打好基礎的情況下好好學習",
            "toTeacher": "感謝老師的指導，讓我了解如何有效的抓住重點並累積實力",
            "toSchool": "化學課的內容得宜且充實"
          }
        },
        {
          "subject": "地科",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常同意",
            "2": "非常同意",
            "3": "同意",
            "4": "非常同意",
            "5": "非常同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "透過整齊的筆記，快速抓住重點\n遇到困難時，老師也能清楚解釋，讓我吸收更多知識",
            "toTeacher": "感謝您的指導，整理出完整的筆記並耐心講解大家不理解的題目",
            "toSchool": "地科課的內容得宜且充實"
          }
        },
        {
          "subject": "科技",
          "teacher": "",
          "group": "",
          "ratings": {
            "1": "非常不同意",
            "2": "非常同意",
            "3": "普通",
            "4": "普通",
            "5": "同意",
            "6": "同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "寫較簡單的程式，嘗試接觸科技領域的相關運用",
            "toTeacher": "感謝您的指導，讓我體驗如何利用AI工具創造出不同的作品",
            "toSchool": "科技課的內容得宜且充實"
          }
        },
        {
          "subject": "ESL",
          "teacher": "Chad",
          "group": "A+(教師：Chad)",
          "ratings": {
            "1": "普通",
            "2": "非常同意",
            "3": "普通",
            "4": "非常同意",
            "5": "同意",
            "6": "非常同意",
            "7": "非常同意",
            "8": "非常同意",
            "9": "非常同意",
            "10": "非常同意"
          },
          "qa": {
            "harvest": "透過故事，連結生活經驗與社會現況",
            "toTeacher": "感謝您的指導，讓我有機會吸收各種不同的價值觀，甚至學習多多開口表達",
            "toSchool": "ESL課的內容得宜且充實"
          }
        }
      ]
    }
  ],
  "aiReport": "\n# 114學年度期末課程評鑑：AI 全面性綜觀與分組適性教學深度分析報告\n\n## 🔍 0. 問卷填答信度與無效問卷分析 (本階段新增)\n\n為確保本次課程評鑑統計結果的真實性，本系統在數據載入前特別執行了 **「直線作答 (Straightlining)」** 與 **「質性敷衍 (Lazy Text)」** 的雙重防護信度分析。\n\n* **分析標準**：若學生在所有科目中，選擇題一致率達 **98% 以上**，且其問答題有 **60% 以上** 填寫為「無、沒有、爛死了、.」等敷衍負向字眼，即判定為無效問卷並予以剔除。\n* **清洗成效**：共從 145 份問卷中篩選並**剔除了 14 份無效問卷**。有效問卷數變為 **131 份**，後續統計均以有效問卷為準，避免極端無效值拉低常態分布平均值。\n* **無效問卷班級分佈**：\n  - **7A 班**：6 筆無效問卷\n  - **7B 班**：3 筆無效問卷\n  - **8A 班**：2 筆無效問卷\n  - **8B 班**：1 筆無效問卷\n  - **高二(理組) 班**：2 筆無效問卷\n\n> [!WARNING]\n> **無效問卷原因分析**：\n  - **學生ID 2 (7A班)**: 量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「././.」等敷衍或負向描述，無任何實質學習回饋。\n  - **學生ID 9 (7A班)**: 量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「棒/棒/棒」等敷衍或負向描述，無任何實質學習回饋。\n  - **學生ID 14 (7A班)**: 量化選擇題有 92% 的科目呈直線填答，且質性問答有 100% 為「no/no/no」等敷衍或負向描述，無任何實質學習回饋。\n  - **學生ID 17 (7A班)**: 量化選擇題有 92% 的科目呈直線填答，且質性問答有 100% 為「no/no/no」等敷衍或負向描述，無任何實質學習回饋。\n  - **學生ID 22 (7A班)**: 量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「國文/無/爛死了」等敷衍或負向描述，無任何實質學習回饋。\n  - **學生ID 29 (7A班)**: 量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「無/無/無」等敷衍或負向描述，無任何實質學習回饋。\n  - **學生ID 40 (7B班)**: 量化選擇題有 92% 的科目呈直線填答，且質性問答有 100% 為「無/無/無」等敷衍或負向描述，無任何實質學習回饋。\n  - **學生ID 42 (7B班)**: 量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「無/無/無」等敷衍或負向描述，無任何實質學習回饋。\n  - **學生ID 56 (7B班)**: 量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「很好/很好/很好」等敷衍或負向描述，無任何實質學習回饋。\n  - **學生ID 66 (8A班)**: 量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「國文/無/吳」等敷衍或負向描述，無任何實質學習回饋。\n  - **學生ID 76 (8A班)**: 量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「無/無/無」等敷衍或負向描述，無任何實質學習回饋。\n  - **學生ID 100 (8B班)**: 量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「沒有/沒有/沒有」等敷衍或負向描述，無任何實質學習回饋。\n  - **學生ID 128 (高二(理組)班)**: 量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「老師十分用心/無/無」等敷衍或負向描述，無任何實質學習回饋。\n  - **學生ID 129 (高二(理組)班)**: 量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「國文知識/無/無」等敷衍或負向描述，無任何實質學習回饋。\n\n> [!IMPORTANT]\n> **行政特別說明**：\n> - **高二(理組)** 在原始收到的問卷中僅有 **2 筆** 回覆。\n> - 此 2 筆回覆經系統信度檢驗，均因 **100% 直線作答（全部勾選非常同意）** 且問答題留言極度敷衍（「國文知識/無/無」），被判定為**無效問卷並予以剔除**。\n> - 這導致高二(理組)在「有效問卷」統計中之有效資料筆數為 **0**。為避免無效數據誤導，高二(理組)將不顯示於班級綜合平均與分析中；若有教師**僅教高二理組**（而在其他班級無課者），其有效評鑑資料亦為 0，便不會顯示在教師名單選單中，此為正常之數據清洗結果。\n\n\n## 📊 一、 全校整體表現指標\n\n全校 10 題課程評鑑核心指標的平均得分（滿分 5.00）如下：\n\n| 指標題號與評鑑面向 | 全校平均分數 | 表現評等 | 重點解讀 |\n| :--- | :---: | :---: | :--- |\n| **Q1. 學生自評：課前預習與課後複習** | <span class=\"badge badge-warning\">3.88</span> | 尚可 | 學生自主預複習習慣仍有提升空間，需教師加強引導學習策略。 |\n| **Q2. 學生自評：準時出席與認真聽講** | <span class=\"badge badge-success\">4.06</span> | 良好 | 學生上課出席率與聽講態度普遍良好。 |\n| **Q3. 學生自評：主動提問與解決問題** | <span class=\"badge badge-warning\">3.89</span> | 尚可 | 課堂主動提問的風氣較弱，顯示學生較偏向被動接收知識。 |\n| **Q4. 教學內容：份量適中** | <span class=\"badge badge-success\">4.06</span> | 良好 | 教師授課進度與份量掌控適宜。 |\n| **Q5. 教學內容：難易度適中** | <span class=\"badge badge-success\">4.06</span> | 良好 | Teaching難易度符合大多數學生水準。 |\n| **Q6. 教學方法：能讓我有效學習** | <span class=\"badge badge-success\">4.03</span> | 良好 | 教學方法符合預期，但在適性引導上仍可微調。 |\n| **Q7. 教學態度：認真負責** | <span class=\"badge badge-primary\">4.15</span> | 優秀 | <strong class=\"highlight-blue\">全校得分最高項</strong>，展現聖心高中全體教師的高度專業與敬業精神！ |\n| **Q8. 學習評量：能幫助了解學習狀況** | <span class=\"badge badge-success\">4.06</span> | 良好 | 評量設計具備回饋功能，能有效檢視學習成效。 |\n| **Q9. 師生關係：相處融洽** | <span class=\"badge badge-primary\">4.13</span> | 優秀 | 師生關係普遍健康、溫馨且融洽。 |\n| **Q10. 綜合滿意度與學習收穫** | <span class=\"badge badge-primary\">4.13</span> | 優秀 | 學生對課程整體滿意度高，認為學習富有收穫。 |\n\n> [!NOTE]\n> **整體關鍵洞察**：全校教師在 **「教學態度認真負責 (4.15)」** 與 **「師生關係融洽 (4.13)」** 獲得最顯著的肯定。相對地，學生的 **「自主預複習 (3.88)」** 與 **「主動提問 (3.89)」** 得分最低。這表明：**學校的教學品質與關懷溫度極佳，但如何引導學生成為「主動的學習者」是未來教學精進的核心課題。**\n\n---\n\n## 🔍 二、 分組與適性教學（跑班分組）深度專題分析\n\n本校在七、八年級實施英文與數學「兩班三組」分流教學，並在高一至高二推動 ESL 與英文分組教學。此政策的初衷在於「因材施教、適性揚才」。以下為大數據解析後的關鍵發現：\n\n### 1. 英文科分組：基礎組成功重建信心，中段組出現「不上不下」塌陷\n* 7A/7B 的英文分組呈現出令人驚豔的適性成效：\n  - **精進組 (A1 - 羅雅苓老師)**：滿意度 **4.42 分**（自評 4.07分）。\n  - **基礎組 (A3 - 邱千芸老師)**：滿意度高達 **4.46 分**（自評 4.07分）！\n  > [!TIP]\n  > **卓越典範**：通常基礎組學生因為學習挫折感重，滿意度會偏低。然而邱千芸老師帶領的 A3 基礎組，滿意度竟然超越精進組。學生質性回饋顯示：「老師非常溫柔有耐心」、「教法簡單易懂」、「不會放棄我們」。這證明**基礎組教師透過簡化教材與強大的人文關懷，成功重建了後段學生的學習信心與興趣**。\n  - **中段組 (A2 - 莊旭惠老師)**：滿意度出現顯著下滑，僅為 **3.52 分**（自評 3.61分）。學生回饋集中於「授課速度稍快」、「作業份量較重」。這反映出中段組可能缺乏精進組的自主挑戰性，又失去了基礎組的細緻鷹架，導致學生學習壓力過大。學校應協助中段組教師微調授課節奏。\n* **高年級英文分組**：\n  - 高一至高二文理組的英文分組普遍由 **鄒湘平老師**（滿意度 **4.35 分**）與 **羅雅苓老師** 授課。高二理組英文 (鄒湘平老師) 滿意度達到良好水準，代表高年級的分組教學在中大班制中仍能維持穩定的教學品質。\n\n### 2. 數學科分組：基礎組面臨深刻的「信心赤字」與「學習斷層」\n與英文科分組的亮眼成效相比，數學科分組教學敲響了適性警鐘：\n- **七年級數學 A+ 組 (精進組 - 陳昱澐老師)**：滿意度 **4.03 分**（自評 3.86分）。\n- **七年級數學 B 組 (基礎組 - 桂松山老師)**：滿意度 **3.75 分**，且**學生學習自評 (Q1-Q3) 平均僅 3.44 分**，為全校最低項目之一。\n- **八年級數學 A 組 (中後段組 - 吳宇綸老師)**：滿意度僅 **3.69 分**（自評 3.65分）。\n* **問題剖析**：\n  - 數學基礎組的質性回饋中，學生大量反映「完全聽不懂」、「上課很無聊」、「考卷真的太難了」。這顯示數學科的分組「防護網」功能未能完全發揮。**基礎組的教學目前偏向「進度的被迫跟隨」，而非「教材難度與學習鷹架的根本分流」**。當評量與教材難度未隨組別大幅調降時，基礎組學生依然在課堂上體驗挫折，導致了深刻的「信心赤字」。\n* **優化建議**：\n  - **評量分流**：數學基礎組（B組）的平時與段考考卷必須降低難度，基本題比重應拉高至 **70% - 80%**，以建立其解題成就感。\n  - **課程減速**：數學科基礎組不應強求與 A+ 組同步進度。應落實「精熟核心概念」（如七年級的二元一次方程、八年級的因式分解基本型），捨棄繁複的延伸計算題。\n\n### 3. ESL 課程：外師教學的「口說亮點」與「低年級文化適應」\nESL 分組課程由 Chad、Sandra、Gina、Roja 四位外籍教師授課，學生普遍給予高度期待，但也顯露了學習落差：\n- **Chad 老師 (滿意度 4.47 分)**：在七年級、八年級、高一及高二文理組均有授課，滿意度均位居全校頂尖。學生反饋：「Chad 的上課充滿活力與遊戲，能讓我們在毫無壓力下開口說英文。」\n- **Sandra 老師 (滿意度 4.29 分)** 與 **Gina 老師 (滿意度 4.37 分)**：亦表現優異，口說與聽力引導深受肯定。\n- **Roja 老師 (滿意度 3.77 分)**：相較之下得分偏低。部分七年級學生在回饋中提到：「完全聽不懂外師在說什麼」、「速度太快，感到很挫折」。\n* **適性建議**：\n  - 外師在面對七、八年級中後段班級時，應加強視覺化教材（如字卡、投影片、肢體語言），或適度安排中籍教師進行課堂協同，避免因溝通不良導致學生放棄學習。\n\n### 4. 本土語選修：小班制的精緻體驗 vs. 大班制的學科化焦慮\n本土語課程雖然不屬於英數分組，但其選修分組的數據形成了強烈對比：\n- **客家語 (張秀玫老師 - 5.00 分)** 與 **手語 (古靜宜老師 - 5.00 分)**：滿意度皆達到完美的 **5.00 滿分**！\n- **閩南語 (曾淑汝 - 3.18 分、廖麗雪 - 2.78 分)**：滿意度在全校敬陪末座。\n* **原因分析**：\n  - **客家語與手語**因選修人數少（客家語 1 人、手語 7 人），屬於超精緻小班教學，師生互動極強，且教學以實用對話、遊戲、動態互動為主。\n  - **閩南語**選修高達 57 人，屬於大班授課，班級秩序管理不易。學生反映「上課內容很無聊，只是讀課文」、「音標很難背，還要寫很多考卷」。這顯示閩南語課程陷入了「傳統學科化」的考核束縛，抹煞了語言學習的樂趣。\n* **優化建議**：\n  - 閩南語課程應擺脫傳統紙筆音標考試，改以閩南語歌謠吟唱、情境劇表演、生活對話錄音等「多元評量」方式，並將大班學生進行分組小隊競賽，提升學習動機。\n\n---\n\n## 🏆 三、 整體優勢亮點與卓越學科排行\n\n除了分組教學，全校常規學科中亦有表現極為突出的亮點：\n\n### 1. 滿意度排行前 5 名之「明星課程與班級」\n* **高二(文組) 數學** (<span class=\"text-success\">4.70 分</span>, 9人) — 在不分組的狀況下，文組學生給予數學極高的滿意度，教師的教學方法显然極受文組學生肯定。\n* **7A/7B 體育** (<span class=\"text-success\">4.61 / 4.59 分</span>, 共65人) — 體育課動態教學、活動設計豐富，深受七年級新生喜愛。\n* **8B 地理** (<span class=\"text-success\">4.59 分</span>, 19人) — 課程架構清晰，教學成效極佳。\n* **8B 科技** (<span class=\"text-success\">4.57 分</span>, 19人) — 科技實作性強（如雷雕、程式設計），激發學生成就感。\n\n---\n\n## ⚠️ 四、 警示區域與待改善課程分析 (非分組學科)\n\n排除本土語之後，仍有部分非分組科目得分偏低（低於 3.80 分），需要行政團隊給予輔導與關注：\n\n### 1. 七年級非考科的結構性挑戰\n* <strong class=\"highlight-red\">7A 生命教育 (3.57分)</strong>、<strong class=\"highlight-red\">7A 音樂 (3.65分)</strong>\n* **問題癥結**：部分七年級學生反映這兩門科目偏向單向講授、評量標準較模糊或活動參與感不足。\n* **建議方案**：引進更具體驗式的教學。音樂課可增加實際樂器彈奏或小組彈唱；生命教育可多採用情境討論、電影導讀與生命故事分享，避免照本宣科。\n\n---\n\n## 🛠️ 五、 具體行動方案與學校政策回饋 (Action Plan)\n\n1. **推動「主動學習」鷹架引導 (針對 Q1 & Q3)**：\n   - 各科教師應推廣「任務型預習」（例如：課前看 3 分鐘影片回答 1 個問題），而非含糊的「課前預習」。\n   - 設計課堂「安全提問機制」，可使用匿名線上提問平台（如 Slido），減少學生怕發問出糗的心理負擔。\n2. **本土語課程轉型工作坊**：\n   - 邀請手語（古靜宜老師）或客家語（張秀玫老師）教師進行校內分享，研討如何將閩南語課程設計得更具備高度師生互動。\n3. **數學科分組教材重構**：\n   - 召開數學科教學研究會，研討 B 組學生的學習評量與教材減量方案，以「帶起每一個孩子」為評量核心，取代繁複的考卷練習。\n",
  "nonGroupTeachers": {
    "7A_國文": "呂宜霖",
    "7A_歷史": "陳瑋筠",
    "7A_地理": "何文達",
    "7A_公民": "吳雯菁",
    "7A_生物": "王世宗",
    "7A_科技": "陳昱澐",
    "7A_音樂": "翟洛嫻",
    "7A_體育": "江霂歖",
    "7A_生命教育": "孔令堅",
    "7B_國文": "呂宜霖",
    "7B_歷史": "陳瑋筠",
    "7B_地理": "何文達",
    "7B_公民": "吳雯菁",
    "7B_生物": "王世宗",
    "7B_科技": "陳昱澐",
    "7B_音樂": "翟洛嫻",
    "7B_體育": "江霂歖",
    "7B_生命教育": "孔令堅",
    "8A_國文": "劉玉華",
    "8A_歷史": "陳瑋筠",
    "8A_地理": "何文達",
    "8A_公民": "吳雯菁",
    "8A_理化": "蔡佳玲",
    "8A_科技": "倪世斌",
    "8B_國文": "呂宜霖",
    "8B_歷史": "陳瑋筠",
    "8B_地理": "何文達",
    "8B_公民": "吳雯菁",
    "8B_理化": "蔡佳玲",
    "8B_科技": "倪世斌",
    "高一_國文": "張秀玫",
    "高一_歷史": "陳瑋筠",
    "高一_地理": "何文達",
    "高一_公民": "陳瑋筠",
    "高一_化學": "楊志元",
    "高一_地科": "蔡玉良",
    "高一_科技": "倪世斌",
    "高二(文組)_國文": "劉玉華",
    "高二(文組)_數學": "蘇試",
    "高二(文組)_歷史": "陳瑋筠",
    "高二(文組)_地理": "何文達",
    "高二(文組)_科技": "倪世斌",
    "高二(理組)_國文": "劉玉華",
    "高二(理組)_數學": "王志遠",
    "高二(理組)_物理": "蔡玉良",
    "高二(理組)_化學": "楊志元",
    "高二(理組)_科技": "倪世斌"
  },
  "invalidStats": {
    "totalInvalid": 14,
    "byClass": {
      "7A": 6,
      "7B": 3,
      "8A": 2,
      "8B": 1,
      "高二(理組)": 2
    },
    "details": [
      {
        "studentId": 2,
        "className": "7A",
        "ratingVal": "非常同意",
        "ratingRatio": "100.0%",
        "lazyRatio": "100.0%",
        "reason": "量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「././.」等敷衍或負向描述，無任何實質學習回饋。"
      },
      {
        "studentId": 9,
        "className": "7A",
        "ratingVal": "普通",
        "ratingRatio": "100.0%",
        "lazyRatio": "100.0%",
        "reason": "量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「棒/棒/棒」等敷衍或負向描述，無任何實質學習回饋。"
      },
      {
        "studentId": 14,
        "className": "7A",
        "ratingVal": "非常同意",
        "ratingRatio": "92.3%",
        "lazyRatio": "100.0%",
        "reason": "量化選擇題有 92% 的科目呈直線填答，且質性問答有 100% 為「no/no/no」等敷衍或負向描述，無任何實質學習回饋。"
      },
      {
        "studentId": 17,
        "className": "7A",
        "ratingVal": "普通",
        "ratingRatio": "92.3%",
        "lazyRatio": "100.0%",
        "reason": "量化選擇題有 92% 的科目呈直線填答，且質性問答有 100% 為「no/no/no」等敷衍或負向描述，無任何實質學習回饋。"
      },
      {
        "studentId": 22,
        "className": "7A",
        "ratingVal": "普通",
        "ratingRatio": "100.0%",
        "lazyRatio": "100.0%",
        "reason": "量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「國文/無/爛死了」等敷衍或負向描述，無任何實質學習回饋。"
      },
      {
        "studentId": 29,
        "className": "7A",
        "ratingVal": "非常同意",
        "ratingRatio": "100.0%",
        "lazyRatio": "100.0%",
        "reason": "量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「無/無/無」等敷衍或負向描述，無任何實質學習回饋。"
      },
      {
        "studentId": 40,
        "className": "7B",
        "ratingVal": "非常同意",
        "ratingRatio": "92.3%",
        "lazyRatio": "100.0%",
        "reason": "量化選擇題有 92% 的科目呈直線填答，且質性問答有 100% 為「無/無/無」等敷衍或負向描述，無任何實質學習回饋。"
      },
      {
        "studentId": 42,
        "className": "7B",
        "ratingVal": "普通",
        "ratingRatio": "100.0%",
        "lazyRatio": "100.0%",
        "reason": "量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「無/無/無」等敷衍或負向描述，無任何實質學習回饋。"
      },
      {
        "studentId": 56,
        "className": "7B",
        "ratingVal": "普通",
        "ratingRatio": "100.0%",
        "lazyRatio": "100.0%",
        "reason": "量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「很好/很好/很好」等敷衍或負向描述，無任何實質學習回饋。"
      },
      {
        "studentId": 66,
        "className": "8A",
        "ratingVal": "普通",
        "ratingRatio": "100.0%",
        "lazyRatio": "100.0%",
        "reason": "量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「國文/無/吳」等敷衍或負向描述，無任何實質學習回饋。"
      },
      {
        "studentId": 76,
        "className": "8A",
        "ratingVal": "同意",
        "ratingRatio": "100.0%",
        "lazyRatio": "100.0%",
        "reason": "量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「無/無/無」等敷衍或負向描述，無任何實質學習回饋。"
      },
      {
        "studentId": 100,
        "className": "8B",
        "ratingVal": "非常同意",
        "ratingRatio": "100.0%",
        "lazyRatio": "100.0%",
        "reason": "量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「沒有/沒有/沒有」等敷衍或負向描述，無任何實質學習回饋。"
      },
      {
        "studentId": 128,
        "className": "高二(理組)",
        "ratingVal": "同意",
        "ratingRatio": "100.0%",
        "lazyRatio": "100.0%",
        "reason": "量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「老師十分用心/無/無」等敷衍或負向描述，無任何實質學習回饋。"
      },
      {
        "studentId": 129,
        "className": "高二(理組)",
        "ratingVal": "非常同意",
        "ratingRatio": "100.0%",
        "lazyRatio": "100.0%",
        "reason": "量化選擇題有 100% 的科目呈直線填答，且質性問答有 100% 為「國文知識/無/無」等敷衍或負向描述，無任何實質學習回饋。"
      }
    ]
  }
};